_posts/2015-11-10-SICP_Exercise_Results.org.html
---
layout: post
title: SICP Exercise Results
---

<div id="outline-container-orgheadline41" class="outline-2">
<h2 id="orgheadline41"><span class="section-number-2">1</span> 1. Building Abstractions with Procedures</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Exercise 1.1</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-scheme">(list 10
      (+ 5 3 4)
      (- 9 1)
      (/ 6 2)
      (+ (* 2 4) (- 4 6))
      )
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">a</span> 3)
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">b</span> (+ a 1))
(list (+ a b (* a b))
      (= a b)
      (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">and</span> (&gt; b a) (&lt; b (* a b)))
          b
          a)
      (<span style="color: #d1f1a9;">cond</span> ((= a 4) 6)
            ((= b 4) (+ 6 7 a))
            (<span style="color: #d1f1a9;">else</span> 25))
      (+ 2 (<span style="color: #d1f1a9;">if</span> (&gt; b a) b a))
      (* (<span style="color: #d1f1a9;">cond</span> ((&gt; a b) a)
               ((&lt; a b) b)
               (<span style="color: #d1f1a9;">else</span> -1))
         (+ a 1)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Exercise 1.2</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-scheme">(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Exercise 1.3</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">func</span> a b c)
  (<span style="color: #d1f1a9;">if</span> (&gt; a b)
      (<span style="color: #d1f1a9;">if</span> (&gt; b c)
          (+ a b)
          (+ a c))
      (<span style="color: #d1f1a9;">if</span> (&gt; a c)
          (+ a b)
          (+ b c))))
(func 4 2 3)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Exercise 1.4</h3>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> Exercise 1.5</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">q</span>) (q))
</pre>
</div>
<p>
This line means to define a <b>non-parameter recursive function</b>. So once it be evaluated, the complier will go into a endless loop.<br  />
The difference between <code>normal order</code> and <code>applicative order</code> is the first one will not eval anything before all the expression is expanded.<br  />
So in this exercise, if the complier is using the <code>applicative order</code> to interpreter the code, it will crash.<br  />
Another interest thing is <code>if</code> syntax. It's a high level structor with a specific process which means there is only one of the expression will be evaluated whatever the predicate is. Hence, if the coplier is using the <code>normal order</code>, the result will be 0.<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> Exercise 1.6</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Same reason as the <code>Exercise 1.6</code>, the <code>new-if</code> is using the <code>cond</code> syntax, and it will evaluate the predicate and the follow expression at the same time. So it should not be used to stop a recursive process.<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> Exercise 1.7</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">improve</span> guess x)
  (/ (+ guess (/ x guess)) 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">abs</span> x)
  (<span style="color: #d1f1a9;">if</span> (&lt; x 0)
      (- x)
      x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">good-enough?</span> guess last-guess)
  (<span style="color: #d1f1a9;">if</span> (&lt; (abs (- (/ guess last-guess) 1)) 0.01)
      #t
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sqrt-iter</span> guess last-guess x)
  (<span style="color: #d1f1a9;">if</span> (= x 0)
      0
      (<span style="color: #d1f1a9;">if</span> (good-enough? guess last-guess)
          guess
          (sqrt-iter (improve guess x) guess x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">my-sqrt</span> x)
  (sqrt-iter 1.0 x x))

(list
 (my-sqrt 10000)
 (my-sqrt 100)
 (my-sqrt 0.0001)
 (my-sqrt 0))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> Exercise 1.8</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">improve</span> guess x)
  (/ (+ (/ x (* guess guess)) (* 2 guess)) 3))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">abs</span> x)
  (<span style="color: #d1f1a9;">if</span> (&lt; x 0)
      (- x)
      x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">good-enough?</span> guess last-guess)
  (<span style="color: #d1f1a9;">if</span> (&lt; (abs (- (/ guess last-guess) 1)) 0.01)
      #t
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cube-iter</span> guess last-guess x)
  (<span style="color: #d1f1a9;">if</span> (= x 0)
      0
      (<span style="color: #d1f1a9;">if</span> (good-enough? guess last-guess)
          guess
          (cube-iter (improve guess x) guess x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">my-cube</span> x)
  (cube-iter 1.0 x x))

(list
 (my-cube 1000000)
 (my-cube 27)
 (my-cube 0.001)
 (my-cube 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.9</span> Exercise 1.9</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">dec</span> x)
  (- x 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mplus1</span> a b)
  (<span style="color: #d1f1a9;">if</span> (= a 0)
      b
      (inc (mplus1 (dec a) b))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mplus2</span> a b)
  (<span style="color: #d1f1a9;">if</span> (= a 0)
      b
      (mplus2 (dec a) (inc b))))

(list (list (mplus1 4 5)
            (inc (mplus1 3 5))
            (inc (inc (mplus1 2 5)))
            (inc (inc (inc (mplus1 1 5))))
            (inc (inc (inc (inc (mplus1 0 5)))))
            (inc (inc (inc (inc 5))))
            (inc (inc (inc 6)))
            (inc (inc 7))
            (inc 8)
            9)

      (list (mplus2 4 5)
            (mplus2 3 6)
            (mplus2 2 7)
            (mplus2 1 8)
            (mplus2 0 9)
            9))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.10</span> Exercise 1.10</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">A</span> x y)
  (<span style="color: #d1f1a9;">cond</span> ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (<span style="color: #d1f1a9;">else</span> (A (- x 1)
                 (A x (- y 1))))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span> n) (A 0 n))  <span style="color: #7285b7; font-style: italic;">;;</span><span style="color: #7285b7; font-style: italic;">2y</span>

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">g</span> n) (A 1 n))  <span style="color: #7285b7; font-style: italic;">;;</span><span style="color: #7285b7; font-style: italic;">2^n</span>

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">h</span> n) (A 2 n))  <span style="color: #7285b7; font-style: italic;">;;</span><span style="color: #7285b7; font-style: italic;">2^(2^n)</span>

(list (A 1 10)
      (A 2 4)
      (A 3 3))
</pre>
</div>
</div>
</div>
