_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.11
- Tree Recursion
#+BEGIN_SRC scheme
  (define (f n)
    (if (< n 3)
        n
        (+ (f (- n 1))
           (* 2 (f (- n 2)))
           (* 3 (f (- n 3))))))

  (list (f 2)
        (f 3)
        (f 4)
        (f 5)
        (f 6)
        (f 7)
        (f 8)
        (f 9))
#+END_SRC

#+RESULTS:
: (2 4 11 25 59 142 335 796)

- Iteration Recursion
#+BEGIN_SRC scheme
  (define (iter-f c lc llc n)
    (cond ((< n 2) n)
          ((= n 2) c)
          (else (iter-f (+ c (* 2 lc) (* 3 llc))
                        c
                        lc
                        (- n 1)))))

  (define (f n)
    (iter-f 2 1 0 n))

  (list (f 2)
        (f 3)
        (f 4)
        (f 5)
        (f 6)
        (f 7)
        (f 8)
        (f 9))
#+END_SRC

#+RESULTS:
: (2 4 11 25 59 142 335 796)
** Exercise 1.12
#+BEGIN_SRC scheme
  (define (pp n i)
    (if (or (= n i) (= i 1))
        1
        (+ (pp (- n 1) (- i 1))
           (pp (- n 1) i))))

  (define (iter-p l i n)
    (if (< i n)
        (iter-p (cons (pp n (+ i 1)) l)
                (+ i 1)
                n)
        l))

  (define (p n)
    (iter-p (list (pp n 1))
            1
            n))

  (list (p 2)
        (p 3)
        (p 4)
        (p 5)
        (p 6))
#+END_SRC

#+RESULTS:
: ((1 1) (1 2 1) (1 3 3 1) (1 4 6 4 1) (1 5 10 10 5 1))
** Exercise 1.13 1.14 1.15
What the hell!
** Exercise 1.16
#+BEGIN_SRC scheme
  (define (even? n)
    (= (remainder n 2) 0))

  (define (square n)
    (* n n))

  (define (fast-expt-iter a b n)
    (cond ((= n 0) a)
          ((even? n) (fast-expt-iter a (square b) (/ n 2)))
          (else (fast-expt-iter (* a b) b (- n 1)))))

  (define (fast-expt b n)
    (fast-expt-iter 1 b n))

  (list (fast-expt 2 5)
        (fast-expt 2 8)
        (fast-expt 2 10)
        (fast-expt 2 11))
#+END_SRC

#+RESULTS:
: (32 256 1024 2048)
** Exercise 1.17 1.18
Using commutation law
#+BEGIN_SRC scheme
  (define (even? n)
    (= (remainder n 2) 0))

  (define (double n)
    (+ n n))

  (define (halve n)
    (/ n 2))

  (define (fast-mult-iter a b n)
    (cond ((= n 0) a)
          ((even? n) (fast-mult-iter a (double b) (halve n)))
          (else (fast-mult-iter (+ a b) b (- n 1)))))

  (define (fast-mult b n)
    (if (< b n)
        (fast-mult-iter 0 n b)
        (fast-mult-iter 0 b n)))

  (list (fast-mult 3 7)
        (fast-mult 5 9)
        (fast-mult 19 111)
        (fast-mult 111 19))
#+END_SRC

#+RESULTS:
: (21 45 2109 2109)
** exercise 1.19
q <- q^2^{} + 2pq
p <- p^2 + q^2
#+BEGIN_SRC scheme
  (define (even? n)
    (= (remainder n 2) 0))

  (define (fib-iter a b p q count)
    (cond ((= count 0) b)
          ((even? count) (fib-iter a
                                   b
                                   (+ (* p p) (* q q))
                                   (+ (* 2 p q) (* q q))
                                   (/ count 2)))
          (else (fib-iter (+ (* b q) (* a (+ p q)))
                          (+ (* b p) (* a q))
                          p
                          q
                          (- count 1)))))

  (define (fib n)
    (fib-iter 1 0 0 1 n))

  (list (fib 1)
        (fib 2)
        (fib 3)
        (fib 4)
        (fib 5)
        (fib 6)
        (fib 7))
#+END_SRC

#+RESULTS:
: (1 1 2 3 5)
** Exercise 1.20

正则序:
#+BEGIN_SRC scheme
  (list (gcd 206 40)
        (gcd 40 (remainder 206 40))
        (gcd (remainder 206 40) (remainder 40 (remainder 206 40)))
        (gcd (remainder 40 (remainder 206 40))
             (remainder (remainder 206 40) (remainder 40 (remainder 206 40))))
        (gcd (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))
             (remainder (remainder 40 (remainder 206 40))
                        (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))))
        (remainder (remainder 206 40) (remainder 40 (remainder 206 40))))
#+END_SRC

#+RESULTS:
| 2 | 2 | 2 | 2 | 2 | 2 |

IF: 0 + 1 + 2 + 4 + 7
GCD: 4
SUM: 18

应用序:
#+BEGIN_SRC scheme
  (list (gcd 206 40)
        (gcd 40 6)
        (gcd 6 4)
        (gcd 4 2)
        (gcd 2 0))
#+END_SRC

#+RESULTS:
| 2 | 2 | 2 | 2 | 2 |

IF: 0
GCD: 4
SUM: 4

** Exercise 1.21
#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (+ test-divisor 1)))))

  (define (divides? a n)
    (= (remainder n a) 0))

  (list (smallest-divisor 199)
        (smallest-divisor 1999)
        (smallest-divisor 19999))
#+END_SRC

#+RESULTS:
: (199 1999 7)

