_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.11</span> Exercise 1.11</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Tree Recursion<br  /></li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span> n)
  (<span style="color: #d1f1a9;">if</span> (&lt; n 3)
      n
      (+ (f (- n 1))
         (* 2 (f (- n 2)))
         (* 3 (f (- n 3))))))

(list (f 2)
      (f 3)
      (f 4)
      (f 5)
      (f 6)
      (f 7)
      (f 8)
      (f 9))
</pre>
</div>

<ul class="org-ul">
<li>Iteration Recursion<br  /></li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter-f</span> c lc llc n)
  (<span style="color: #d1f1a9;">cond</span> ((&lt; n 2) n)
        ((= n 2) c)
        (<span style="color: #d1f1a9;">else</span> (iter-f (+ c (* 2 lc) (* 3 llc))
                      c
                      lc
                      (- n 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span> n)
  (iter-f 2 1 0 n))

(list (f 2)
      (f 3)
      (f 4)
      (f 5)
      (f 6)
      (f 7)
      (f 8)
      (f 9))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.12</span> Exercise 1.12</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">pp</span> n i)
  (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">or</span> (= n i) (= i 1))
      1
      (+ (pp (- n 1) (- i 1))
         (pp (- n 1) i))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter-p</span> l i n)
  (<span style="color: #d1f1a9;">if</span> (&lt; i n)
      (iter-p (cons (pp n (+ i 1)) l)
              (+ i 1)
              n)
      l))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">p</span> n)
  (iter-p (list (pp n 1))
          1
          n))

(list (p 2)
      (p 3)
      (p 4)
      (p 5)
      (p 6))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.13</span> Exercise 1.13 1.14 1.15</h3>
<div class="outline-text-3" id="text-1-13">
<p>
What the hell!<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.14</span> Exercise 1.16</h3>
<div class="outline-text-3" id="text-1-14">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">even?</span> n)
  (= (remainder n 2) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-expt-iter</span> a b n)
  (<span style="color: #d1f1a9;">cond</span> ((= n 0) a)
        ((even? n) (fast-expt-iter a (square b) (/ n 2)))
        (<span style="color: #d1f1a9;">else</span> (fast-expt-iter (* a b) b (- n 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-expt</span> b n)
  (fast-expt-iter 1 b n))

(list (fast-expt 2 5)
      (fast-expt 2 8)
      (fast-expt 2 10)
      (fast-expt 2 11))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">1.15</span> Exercise 1.17 1.18</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Using commutation law<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">even?</span> n)
  (= (remainder n 2) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">double</span> n)
  (+ n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">halve</span> n)
  (/ n 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-mult-iter</span> a b n)
  (<span style="color: #d1f1a9;">cond</span> ((= n 0) a)
        ((even? n) (fast-mult-iter a (double b) (halve n)))
        (<span style="color: #d1f1a9;">else</span> (fast-mult-iter (+ a b) b (- n 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-mult</span> b n)
  (<span style="color: #d1f1a9;">if</span> (&lt; b n)
      (fast-mult-iter 0 n b)
      (fast-mult-iter 0 b n)))

(list (fast-mult 3 7)
      (fast-mult 5 9)
      (fast-mult 19 111)
      (fast-mult 111 19))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.16</span> exercise 1.19</h3>
<div class="outline-text-3" id="text-1-16">
<p>
q &lt;- q^2<sup>nil</sup> + 2pq<br  />
p &lt;- p^2 + q^2<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">even?</span> n)
  (= (remainder n 2) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fib-iter</span> a b p q count)
  (<span style="color: #d1f1a9;">cond</span> ((= count 0) b)
        ((even? count) (fib-iter a
                                 b
                                 (+ (* p p) (* q q))
                                 (+ (* 2 p q) (* q q))
                                 (/ count 2)))
        (<span style="color: #d1f1a9;">else</span> (fib-iter (+ (* b q) (* a (+ p q)))
                        (+ (* b p) (* a q))
                        p
                        q
                        (- count 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fib</span> n)
  (fib-iter 1 0 0 1 n))

(list (fib 1)
      (fib 2)
      (fib 3)
      (fib 4)
      (fib 5)
      (fib 6)
      (fib 7))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">1.17</span> Exercise 1.20</h3>
<div class="outline-text-3" id="text-1-17">
<p>
正则序:<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(list (gcd 206 40)
      (gcd 40 (remainder 206 40))
      (gcd (remainder 206 40) (remainder 40 (remainder 206 40)))
      (gcd (remainder 40 (remainder 206 40))
           (remainder (remainder 206 40) (remainder 40 (remainder 206 40))))
      (gcd (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))
           (remainder (remainder 40 (remainder 206 40))
                      (remainder (remainder 206 40) (remainder 40 (remainder 206 40)))))
      (remainder (remainder 206 40) (remainder 40 (remainder 206 40))))
</pre>
</div>

<p>
IF: 0 + 1 + 2 + 4 + 7<br  />
GCD: 4<br  />
SUM: 18<br  />
</p>

<p>
应用序:<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(list (gcd 206 40)
      (gcd 40 6)
      (gcd 6 4)
      (gcd 4 2)
      (gcd 2 0))
</pre>
</div>

<p>
IF: 0<br  />
GCD: 4<br  />
SUM: 4<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">1.18</span> Exercise 1.21</h3>
<div class="outline-text-3" id="text-1-18">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">smallest-divisor</span> n)
  (find-divisor n 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">find-divisor</span> n test-divisor)
  (<span style="color: #d1f1a9;">cond</span> ((&gt; (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (<span style="color: #d1f1a9;">else</span> (find-divisor n (+ test-divisor 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">divides?</span> a n)
  (= (remainder n a) 0))

(list (smallest-divisor 199)
      (smallest-divisor 1999)
      (smallest-divisor 19999))
</pre>
</div>
</div>
</div>
