_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.22
#+BEGIN_SRC scheme
  (define (my-return)
    (display "loading ...")
    5)

  (define lazy (my-return))

  (list lazy
        lazy
        lazy)
#+END_SRC

#+RESULTS:
: (5 5 5)


#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (+ test-divisor 1)))))

  (define (divides? a n)
    (= (remainder n a) 0))

  (define (prime? n)
    (= n (smallest-divisor n)))

  (define (runtime)
    (tms:clock (times)))

  (define (time-prime-test n)
    (start-prime-test n (runtime)))

  ;; Need to change this
  (define (start-prime-test n start-time)
    (if (prime? n)
        (begin (newline)
               (display n)
               (report-prime (- (runtime) start-time))
               #t)
        #f))

  (define (report-prime elapsed-time)
    (display " ** ")
    (display elapsed-time))

  (define (next-odd n)
    (if (= (remainder n 2) 0)
        (+ n 1)
        (+ n 2)))

  (define (search-for-primes-iter i n)
    (if (> i 0)
        (if (time-prime-test n)
            (search-for-primes-iter (- i 1) (next-odd n))
            (search-for-primes-iter i (next-odd n)))))

  (define (search-for-primes n)
    (search-for-primes-iter 3 n))

  (list (search-for-primes 1000)
        (search-for-primes 10000)
        (search-for-primes 100000)
        (search-for-primes 1000000)
        (search-for-primes 10000000)
        (search-for-primes 100000000)
        (search-for-primes 1000000000)
        (search-for-primes 10000000000)
        (search-for-primes 100000000000)
        (search-for-primes 1000000000000))
#+END_SRC

#+RESULTS:
: (#<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified>)

** Exercise 1.23
#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (define (next n)
    (if (= n 2)
        3
        (+ n 2)))

  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (next test-divisor)))))

  (define (divides? a n)
    (= (remainder n a) 0))

  (define (prime? n)
    (= n (smallest-divisor n)))

  (define (runtime)
    (tms:clock (times)))

  (define (time-prime-test n)
    (start-prime-test n (runtime)))

  ;; Need to change this
  (define (start-prime-test n start-time)
    (if (prime? n)
        (begin (newline)
               (display n)
               (report-prime (- (runtime) start-time))
               #t)
        #f))

  (define (report-prime elapsed-time)
    (display " ** ")
    (display elapsed-time))

  (define (next-odd n)
    (if (= (remainder n 2) 0)
        (+ n 1)
        (+ n 2)))

  (define (search-for-primes-iter i n)
    (if (> i 0)
        (if (time-prime-test n)
            (search-for-primes-iter (- i 1) (next-odd n))
            (search-for-primes-iter i (next-odd n)))))

  (define (search-for-primes n)
    (search-for-primes-iter 3 n))

  (list (search-for-primes 1000)
        (search-for-primes 10000)
        (search-for-primes 100000)
        (search-for-primes 1000000)
        (search-for-primes 10000000)
        (search-for-primes 100000000)
        (search-for-primes 1000000000)
        (search-for-primes 10000000000)
        (search-for-primes 100000000000)
        (search-for-primes 1000000000000))
#+END_SRC

#+RESULTS:
: (#<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified>)

** Exercise 1.24
#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (even? n)
    (= (remainder n 2) 0))

  (define (expmod base exp m)
    (cond ((= exp 0) 1)
          ((even? exp)
           (remainder (square (expmod base (/ exp 2) m))
                      m))
          (else
           (remainder (* base (expmod base (- exp 1) m))
                      m))))

  (define (fermat-test n)
    (define (try-it a)
      (= (expmod a n n) a))
    (try-it (+ 1 (random (- n 1)))))

  (define (fast-prime? n times)
    (cond ((= times 0) #t)
          ((fermat-test n) (fast-prime? n (- times 1)))
          (else #f)))

  (define (runtime)
    (tms:clock (times)))

  (define (time-prime-test n)
    (start-prime-test n (runtime)))

  ;; Need to change this
  (define (start-prime-test n start-time)
    (if (fast-prime? n 100)
        (begin (newline)
               (display n)
               (report-prime (- (runtime) start-time))
               #t)
        #f))

  (define (report-prime elapsed-time)
    (display " ** ")
    (display elapsed-time))

  (define (next-odd n)
    (if (= (remainder n 2) 0)
        (+ n 1)
        (+ n 2)))

  (define (search-for-primes-iter i n)
    (if (> i 0)
        (if (time-prime-test n)
            (search-for-primes-iter (- i 1) (next-odd n))
            (search-for-primes-iter i (next-odd n)))))

  (define (search-for-primes n)
    (search-for-primes-iter 3 n))

  (list (search-for-primes 1000)
        (search-for-primes 10000)
        (search-for-primes 100000)
        (search-for-primes 1000000)
        (search-for-primes 10000000)
        (search-for-primes 100000000)
        (search-for-primes 1000000000)
        (search-for-primes 10000000000)
        (search-for-primes 100000000000)
        (search-for-primes 1000000000000))

#+END_SRC

#+RESULTS:
: (#<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified>)

