_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.19</span> Exercise 1.22</h3>
<div class="outline-text-3" id="text-1-19">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">my-return</span>)
  (display <span style="color: #99ffff;">"loading ..."</span>)
  5)

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">lazy</span> (my-return))

(list lazy
      lazy
      lazy)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">smallest-divisor</span> n)
  (find-divisor n 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">find-divisor</span> n test-divisor)
  (<span style="color: #d1f1a9;">cond</span> ((&gt; (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (<span style="color: #d1f1a9;">else</span> (find-divisor n (+ test-divisor 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">divides?</span> a n)
  (= (remainder n a) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">prime?</span> n)
  (= n (smallest-divisor n)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">runtime</span>)
  (tms:clock (times)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">time-prime-test</span> n)
  (start-prime-test n (runtime)))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Need to change this</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-prime-test</span> n start-time)
  (<span style="color: #d1f1a9;">if</span> (prime? n)
      (<span style="color: #d1f1a9;">begin</span> (newline)
             (display n)
             (report-prime (- (runtime) start-time))
             #t)
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">report-prime</span> elapsed-time)
  (display <span style="color: #99ffff;">" ** "</span>)
  (display elapsed-time))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next-odd</span> n)
  (<span style="color: #d1f1a9;">if</span> (= (remainder n 2) 0)
      (+ n 1)
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes-iter</span> i n)
  (<span style="color: #d1f1a9;">if</span> (&gt; i 0)
      (<span style="color: #d1f1a9;">if</span> (time-prime-test n)
          (search-for-primes-iter (- i 1) (next-odd n))
          (search-for-primes-iter i (next-odd n)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes</span> n)
  (search-for-primes-iter 3 n))

(list (search-for-primes 1000)
      (search-for-primes 10000)
      (search-for-primes 100000)
      (search-for-primes 1000000)
      (search-for-primes 10000000)
      (search-for-primes 100000000)
      (search-for-primes 1000000000)
      (search-for-primes 10000000000)
      (search-for-primes 100000000000)
      (search-for-primes 1000000000000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.20</span> Exercise 1.23</h3>
<div class="outline-text-3" id="text-1-20">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">smallest-divisor</span> n)
  (find-divisor n 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next</span> n)
  (<span style="color: #d1f1a9;">if</span> (= n 2)
      3
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">find-divisor</span> n test-divisor)
  (<span style="color: #d1f1a9;">cond</span> ((&gt; (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (<span style="color: #d1f1a9;">else</span> (find-divisor n (next test-divisor)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">divides?</span> a n)
  (= (remainder n a) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">prime?</span> n)
  (= n (smallest-divisor n)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">runtime</span>)
  (tms:clock (times)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">time-prime-test</span> n)
  (start-prime-test n (runtime)))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Need to change this</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-prime-test</span> n start-time)
  (<span style="color: #d1f1a9;">if</span> (prime? n)
      (<span style="color: #d1f1a9;">begin</span> (newline)
             (display n)
             (report-prime (- (runtime) start-time))
             #t)
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">report-prime</span> elapsed-time)
  (display <span style="color: #99ffff;">" ** "</span>)
  (display elapsed-time))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next-odd</span> n)
  (<span style="color: #d1f1a9;">if</span> (= (remainder n 2) 0)
      (+ n 1)
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes-iter</span> i n)
  (<span style="color: #d1f1a9;">if</span> (&gt; i 0)
      (<span style="color: #d1f1a9;">if</span> (time-prime-test n)
          (search-for-primes-iter (- i 1) (next-odd n))
          (search-for-primes-iter i (next-odd n)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes</span> n)
  (search-for-primes-iter 3 n))

(list (search-for-primes 1000)
      (search-for-primes 10000)
      (search-for-primes 100000)
      (search-for-primes 1000000)
      (search-for-primes 10000000)
      (search-for-primes 100000000)
      (search-for-primes 1000000000)
      (search-for-primes 10000000000)
      (search-for-primes 100000000000)
      (search-for-primes 1000000000000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">1.21</span> Exercise 1.24</h3>
<div class="outline-text-3" id="text-1-21">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">even?</span> n)
  (= (remainder n 2) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">expmod</span> base exp m)
  (<span style="color: #d1f1a9;">cond</span> ((= exp 0) 1)
        ((even? exp)
         (remainder (square (expmod base (/ exp 2) m))
                    m))
        (<span style="color: #d1f1a9;">else</span>
         (remainder (* base (expmod base (- exp 1) m))
                    m))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fermat-test</span> n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">try-it</span> a)
    (= (expmod a n n) a))
  (try-it (+ 1 (random (- n 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-prime?</span> n times)
  (<span style="color: #d1f1a9;">cond</span> ((= times 0) #t)
        ((fermat-test n) (fast-prime? n (- times 1)))
        (<span style="color: #d1f1a9;">else</span> #f)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">runtime</span>)
  (tms:clock (times)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">time-prime-test</span> n)
  (start-prime-test n (runtime)))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Need to change this</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-prime-test</span> n start-time)
  (<span style="color: #d1f1a9;">if</span> (fast-prime? n 100)
      (<span style="color: #d1f1a9;">begin</span> (newline)
             (display n)
             (report-prime (- (runtime) start-time))
             #t)
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">report-prime</span> elapsed-time)
  (display <span style="color: #99ffff;">" ** "</span>)
  (display elapsed-time))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next-odd</span> n)
  (<span style="color: #d1f1a9;">if</span> (= (remainder n 2) 0)
      (+ n 1)
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes-iter</span> i n)
  (<span style="color: #d1f1a9;">if</span> (&gt; i 0)
      (<span style="color: #d1f1a9;">if</span> (time-prime-test n)
          (search-for-primes-iter (- i 1) (next-odd n))
          (search-for-primes-iter i (next-odd n)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes</span> n)
  (search-for-primes-iter 3 n))

(list (search-for-primes 1000)
      (search-for-primes 10000)
      (search-for-primes 100000)
      (search-for-primes 1000000)
      (search-for-primes 10000000)
      (search-for-primes 100000000)
      (search-for-primes 1000000000)
      (search-for-primes 10000000000)
      (search-for-primes 100000000000)
      (search-for-primes 1000000000000))
</pre>
</div>
</div>
</div>
