_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.28
#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (even? n)
    (= (remainder n 2) 0))

  (define (trivial-square-test a n )
    (if (and (not (= a 1))
             (not (= a (- n 1)))
             (= (remainder (square a) n) 1))
        0
        a))

  (define (expmod base exp m)
    (cond ((= exp 0) 1)
          ((even? exp)
           (remainder (square (trivial-square-test (expmod base (/ exp 2) m) m))
                      m))
          (else
           (remainder (* base (expmod base (- exp 1) m))
                      m))))

  (define (rabin-test n)
    (define (try-it a)
      (= (expmod a (- n 1) n) 1))
    (try-it (+ 1 (random (- n 1)))))

  (define (fast-prime? n times)
    (cond ((= times 0) #t)
          ((rabin-test n) (fast-prime? n (- times 1)))
          (else #f)))

  (define (runtime)
    (tms:clock (times)))

  (define (time-prime-test n)
    (start-prime-test n (runtime)))

  ;; Need to change this
  (define (start-prime-test n start-time)
    (if (fast-prime? n 100)
        (begin (newline)
               (display n)
               (report-prime (- (runtime) start-time))
               #t)
        #f))

  (define (report-prime elapsed-time)
    (display " ** ")
    (display elapsed-time))

  (define (next-odd n)
    (if (= (remainder n 2) 0)
        (+ n 1)
        (+ n 2)))

  (define (search-for-primes-iter i n)
    (if (> i 0)
        (if (time-prime-test n)
            (search-for-primes-iter (- i 1) (next-odd n))
            (search-for-primes-iter i (next-odd n)))))

  (define (search-for-primes n)
    (search-for-primes-iter 3 n))

  (list (search-for-primes 1000)
        (search-for-primes 10000)
        (search-for-primes 100000)
        (search-for-primes 1000000)
        (search-for-primes 10000000)
        (search-for-primes 100000000)
        (search-for-primes 1000000000)
        (search-for-primes 10000000000)
        (search-for-primes 100000000000)
        (search-for-primes 1000000000000))
#+END_SRC

#+RESULTS:
: (#<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified> #<unspecified>)
** Exercise 1.29
#+BEGIN_SRC scheme
  (define (sum term a next b)
    (if (> a b)
        0
        (+ (term a)
           (sum term (next a) next b))))

  (define (integral f a b n)
    (define h (/ (- b a) n))
    (define (new-f i)
      (* (+ 2 (* 2 (remainder i 2)))
         (f (+ a (* i h)))))
    (/ (* h
          (+ (f a)
             (f b)
             (sum new-f 1 (lambda (x) (+ x 1)) (- n 1))))
       3.0))

  (define (cube x)
    (* x x x))

  (list (integral cube 0 1.0 100)
        (integral cube 0 1.0 1000))
#+END_SRC

#+RESULTS:
: (0.25000000000000006 0.25000000000000006)

** Exercise 1.30
#+BEGIN_SRC scheme
  (define (sum term a next b)
    (define (iter a result)
      (if (> a b)
          result
          (iter (next a)
                (+ result (term a)))))
    (iter a 0))

  (define (inc x)
    (+ x 1))

  (list (sum (lambda (x) x) 1 inc 10)
        (sum (lambda (x) (* x x x)) 1 inc 10))
#+END_SRC

#+RESULTS:
: (55 3025)

** Exercise 1.31
#+BEGIN_SRC scheme
  (define (product term a next b)
    (define (iter a result)
      (if (> a b)
          result
          (iter (next a)
                (* result (term a)))))
    (iter a 1))

  (define (inc x)
    (+ x 1))

  (define (square x)
    (* x x))

  (define (factorial n)
    (product (lambda (x) x) 1 inc n))

  (define (PI)
    (define (like-PI n)
      (* 4.0
         (/ 2 (+ 3 (* n 2)))
         (product (lambda (x) (square (/ (+ 2 (* x 2))
                                         (+ 1 (* x 2))))) 1 inc n)))
    (like-PI 10000))

  (list (factorial 5)
        (PI))
#+END_SRC

#+RESULTS:
: (120 3.1415141265341364)

** Exercise 1.32
#+BEGIN_SRC scheme
  (define (accumulate combiner null-value term a next b)
    (define (iter a result)
      (if (> a b)
          result
          (iter (next a)
                (combiner result (term a)))))
    (iter a null-value))

  (define (sum term a next b)
    (accumulate (lambda (x y) (+ x y))
                0
                term a next b))

  (define (inc x)
    (+ x 1))

  (list (sum (lambda (x) x) 0 inc 10))
#+END_SRC

#+RESULTS:
| 55 |

