_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">1.22</span> Exercise 1.28</h3>
<div class="outline-text-3" id="text-1-22">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">even?</span> n)
  (= (remainder n 2) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">trivial-square-test</span> a n )
  (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">and</span> (not (= a 1))
           (not (= a (- n 1)))
           (= (remainder (square a) n) 1))
      0
      a))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">expmod</span> base exp m)
  (<span style="color: #d1f1a9;">cond</span> ((= exp 0) 1)
        ((even? exp)
         (remainder (square (trivial-square-test (expmod base (/ exp 2) m) m))
                    m))
        (<span style="color: #d1f1a9;">else</span>
         (remainder (* base (expmod base (- exp 1) m))
                    m))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">rabin-test</span> n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">try-it</span> a)
    (= (expmod a (- n 1) n) 1))
  (try-it (+ 1 (random (- n 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fast-prime?</span> n times)
  (<span style="color: #d1f1a9;">cond</span> ((= times 0) #t)
        ((rabin-test n) (fast-prime? n (- times 1)))
        (<span style="color: #d1f1a9;">else</span> #f)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">runtime</span>)
  (tms:clock (times)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">time-prime-test</span> n)
  (start-prime-test n (runtime)))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Need to change this</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-prime-test</span> n start-time)
  (<span style="color: #d1f1a9;">if</span> (fast-prime? n 100)
      (<span style="color: #d1f1a9;">begin</span> (newline)
             (display n)
             (report-prime (- (runtime) start-time))
             #t)
      #f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">report-prime</span> elapsed-time)
  (display <span style="color: #99ffff;">" ** "</span>)
  (display elapsed-time))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next-odd</span> n)
  (<span style="color: #d1f1a9;">if</span> (= (remainder n 2) 0)
      (+ n 1)
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes-iter</span> i n)
  (<span style="color: #d1f1a9;">if</span> (&gt; i 0)
      (<span style="color: #d1f1a9;">if</span> (time-prime-test n)
          (search-for-primes-iter (- i 1) (next-odd n))
          (search-for-primes-iter i (next-odd n)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">search-for-primes</span> n)
  (search-for-primes-iter 3 n))

(list (search-for-primes 1000)
      (search-for-primes 10000)
      (search-for-primes 100000)
      (search-for-primes 1000000)
      (search-for-primes 10000000)
      (search-for-primes 100000000)
      (search-for-primes 1000000000)
      (search-for-primes 10000000000)
      (search-for-primes 100000000000)
      (search-for-primes 1000000000000))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">1.23</span> Exercise 1.29</h3>
<div class="outline-text-3" id="text-1-23">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sum</span> term a next b)
  (<span style="color: #d1f1a9;">if</span> (&gt; a b)
      0
      (+ (term a)
         (sum term (next a) next b))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">integral</span> f a b n)
  (<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">h</span> (/ (- b a) n))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">new-f</span> i)
    (* (+ 2 (* 2 (remainder i 2)))
       (f (+ a (* i h)))))
  (/ (* h
        (+ (f a)
           (f b)
           (sum new-f 1 (<span style="color: #d1f1a9;">lambda</span> (x) (+ x 1)) (- n 1))))
     3.0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cube</span> x)
  (* x x x))

(list (integral cube 0 1.0 100)
      (integral cube 0 1.0 1000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">1.24</span> Exercise 1.30</h3>
<div class="outline-text-3" id="text-1-24">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sum</span> term a next b)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter</span> a result)
    (<span style="color: #d1f1a9;">if</span> (&gt; a b)
        result
        (iter (next a)
              (+ result (term a)))))
  (iter a 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(list (sum (<span style="color: #d1f1a9;">lambda</span> (x) x) 1 inc 10)
      (sum (<span style="color: #d1f1a9;">lambda</span> (x) (* x x x)) 1 inc 10))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">1.25</span> Exercise 1.31</h3>
<div class="outline-text-3" id="text-1-25">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">product</span> term a next b)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter</span> a result)
    (<span style="color: #d1f1a9;">if</span> (&gt; a b)
        result
        (iter (next a)
              (* result (term a)))))
  (iter a 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x)
  (* x x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">factorial</span> n)
  (product (<span style="color: #d1f1a9;">lambda</span> (x) x) 1 inc n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">PI</span>)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">like-PI</span> n)
    (* 4.0
       (/ 2 (+ 3 (* n 2)))
       (product (<span style="color: #d1f1a9;">lambda</span> (x) (square (/ (+ 2 (* x 2))
                                       (+ 1 (* x 2))))) 1 inc n)))
  (like-PI 10000))

(list (factorial 5)
      (PI))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">1.26</span> Exercise 1.32</h3>
<div class="outline-text-3" id="text-1-26">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> combiner null-value term a next b)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter</span> a result)
    (<span style="color: #d1f1a9;">if</span> (&gt; a b)
        result
        (iter (next a)
              (combiner result (term a)))))
  (iter a null-value))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sum</span> term a next b)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (x y) (+ x y))
              0
              term a next b))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(list (sum (<span style="color: #d1f1a9;">lambda</span> (x) x) 0 inc 10))
</pre>
</div>
</div>
</div>
