_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.33
#+BEGIN_SRC scheme
  (define (square n)
    (* n n))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (define (next n)
    (if (= n 2)
        3
        (+ n 2)))

  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
          ((divides? test-divisor n) test-divisor)
          (else (find-divisor n (next test-divisor)))))

  (define (divides? a n)
    (= (remainder n a) 0))

  (define (prime? n)
    (= n (smallest-divisor n)))

  (define (filtered-accumulate filter combiner null-value term a next b)
    (define (iter a result)
      (cond ((> a b) result)
            ((filter a) (iter (next a)
                              (combiner result (term a))))
            (else (iter (next a) result))))
    (iter a null-value))

  (define (sum term a next b)
    (filtered-accumulate (lambda (x) #t)
                         (lambda (x y) (+ x y))
                         0
                         term a next b))

  (define (inc x)
    (+ x 1))

  (define (prime-sum a b)
    (filtered-accumulate prime?
                         (lambda (x y) (+ x y))
                         0
                         (lambda (x) x)
                         a
                         inc
                         b))

  (define (prime-n n)
    (filtered-accumulate (lambda (x)
                           (= (gcd x n)
                              1))
                         (lambda (x y) (+ x y))
                         0
                         (lambda (x) x)
                         1
                         inc
                         n))

  (list (sum (lambda (x) x) 0 inc 10)
        (prime-sum 0 10)
        (prime-n 10))
#+END_SRC

#+RESULTS:
| 55 | 18 | 20 |
** Exercise 1.34
Give a error to use ~2~ as a function.
** Exercise 1.35
#+BEGIN_SRC scheme
  (define tolerance 0.00001)

  (define (fixed-point f guess)
    (let ((next-guess (f guess)))
      (begin (display next-guess)
             (newline)
             (if (> tolerance
                    (abs (- guess next-guess)))
                 next-guess
                 (fixed-point f next-guess)))))

  (fixed-point (lambda (x) (+ 1 (/ 1 x))) 1.0)
#+END_SRC

#+RESULTS:
: 1.6180327868852458

** Exercise 1.36
#+BEGIN_SRC scheme
  (define tolerance 0.00001)

  (define (average x y)
    (/ (+ x y)
       2))

  (define (fixed-point f guess)
    (let ((next-guess (f guess)))
      (begin (display next-guess)
             (newline)
             (if (> tolerance
                    (abs (- guess next-guess)))
                 next-guess
                 (fixed-point f next-guess)))))

  (fixed-point (lambda (x)
                 (let ((log1000 (log 1000)))
                   (/ log1000 (log x))))
               10.0)

  (newline)

  (fixed-point (lambda (x)
                 (let ((log1000 (log 1000)))
                   (average (/ log1000 (log x))
                            x)))
               10.0)
#+END_SRC

#+RESULTS:
: 4.555536206185039
** Exercise 1.37
#+BEGIN_SRC scheme
  (define (cont-frac N D k)
    (define (cont-frac-recur i)
      (if (> i k)
          0
          (/ (N i) (+ (D i)
                      (cont-frac-recur (+ i 1))))))
    (cont-frac-recur 1))

  (/ 1 (cont-frac (lambda (i) 1.0)
                  (lambda (i) 1.0)
                  100))
#+END_SRC

#+RESULTS:
: 1.618033988749895

#+BEGIN_SRC scheme
  (define (cont-frac N D k)
    (define (cont-frac-iter i result)
      (if (= i 1)
          result
          (cont-frac-iter (- i 1)
                          (/ (N i) (+ (D i) result)))))
    (cont-frac-iter k 0))

  (/ 1 (cont-frac (lambda (i) 1.0)
                  (lambda (i) 1.0)
                  100))

#+END_SRC

#+RESULTS:
: 1.618033988749895

CPS iteration
#+BEGIN_SRC scheme
  (define (identity x) x)

  (define (cont-frac N D k)
    (define (cont-frac-cps i f)
      (if (> i k)
          (f 0)
          (cont-frac-cps (+ i 1)
                         (lambda (x)
                           (f (/ (N i)
                                 (+ (D i) x)))))))
    (cont-frac-cps 1 identity))

  (/ 1 (cont-frac (lambda (i) 1.0)
                  (lambda (i) 1.0)
                  100))

#+END_SRC

#+RESULTS:
: 1.618033988749895
** Exercise 1.38
#+BEGIN_SRC scheme
  (define (identity x) x)

  (define (cont-frac N D k)
    (define (cont-frac-cps i f)
      (if (> i k)
          (f 0)
          (cont-frac-cps (+ i 1)
                         (lambda (x)
                           (f (/ (N i)
                                 (+ (D i) x)))))))
    (cont-frac-cps 1 identity))

  (define (D i)
    (if (= (remainder i 3) 2)
        (* 2 (ceiling-quotient i 3))
        1))

  (+ 2 (cont-frac (lambda (i) 1.0)
                  D
                  100))
#+END_SRC

#+RESULTS:
: 2.7182818284590455
