_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">1.27</span> Exercise 1.33</h3>
<div class="outline-text-3" id="text-1-27">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> n)
  (* n n))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">smallest-divisor</span> n)
  (find-divisor n 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">next</span> n)
  (<span style="color: #d1f1a9;">if</span> (= n 2)
      3
      (+ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">find-divisor</span> n test-divisor)
  (<span style="color: #d1f1a9;">cond</span> ((&gt; (square test-divisor) n) n)
        ((divides? test-divisor n) test-divisor)
        (<span style="color: #d1f1a9;">else</span> (find-divisor n (next test-divisor)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">divides?</span> a n)
  (= (remainder n a) 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">prime?</span> n)
  (= n (smallest-divisor n)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">filtered-accumulate</span> filter combiner null-value term a next b)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter</span> a result)
    (<span style="color: #d1f1a9;">cond</span> ((&gt; a b) result)
          ((filter a) (iter (next a)
                            (combiner result (term a))))
          (<span style="color: #d1f1a9;">else</span> (iter (next a) result))))
  (iter a null-value))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sum</span> term a next b)
  (filtered-accumulate (<span style="color: #d1f1a9;">lambda</span> (x) #t)
                       (<span style="color: #d1f1a9;">lambda</span> (x y) (+ x y))
                       0
                       term a next b))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">prime-sum</span> a b)
  (filtered-accumulate prime?
                       (<span style="color: #d1f1a9;">lambda</span> (x y) (+ x y))
                       0
                       (<span style="color: #d1f1a9;">lambda</span> (x) x)
                       a
                       inc
                       b))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">prime-n</span> n)
  (filtered-accumulate (<span style="color: #d1f1a9;">lambda</span> (x)
                         (= (gcd x n)
                            1))
                       (<span style="color: #d1f1a9;">lambda</span> (x y) (+ x y))
                       0
                       (<span style="color: #d1f1a9;">lambda</span> (x) x)
                       1
                       inc
                       n))

(list (sum (<span style="color: #d1f1a9;">lambda</span> (x) x) 0 inc 10)
      (prime-sum 0 10)
      (prime-n 10))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">1.28</span> Exercise 1.34</h3>
<div class="outline-text-3" id="text-1-28">
<p>
Give a error to use <code>2</code> as a function.<br  />
</p>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">1.29</span> Exercise 1.35</h3>
<div class="outline-text-3" id="text-1-29">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">tolerance</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point</span> f guess)
  (<span style="color: #d1f1a9;">let</span> ((next-guess (f guess)))
    (<span style="color: #d1f1a9;">begin</span> (display next-guess)
           (newline)
           (<span style="color: #d1f1a9;">if</span> (&gt; tolerance
                  (abs (- guess next-guess)))
               next-guess
               (fixed-point f next-guess)))))

(fixed-point (<span style="color: #d1f1a9;">lambda</span> (x) (+ 1 (/ 1 x))) 1.0)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">1.30</span> Exercise 1.36</h3>
<div class="outline-text-3" id="text-1-30">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">tolerance</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average</span> x y)
  (/ (+ x y)
     2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point</span> f guess)
  (<span style="color: #d1f1a9;">let</span> ((next-guess (f guess)))
    (<span style="color: #d1f1a9;">begin</span> (display next-guess)
           (newline)
           (<span style="color: #d1f1a9;">if</span> (&gt; tolerance
                  (abs (- guess next-guess)))
               next-guess
               (fixed-point f next-guess)))))

(fixed-point (<span style="color: #d1f1a9;">lambda</span> (x)
               (<span style="color: #d1f1a9;">let</span> ((log1000 (log 1000)))
                 (/ log1000 (log x))))
             10.0)

(newline)

(fixed-point (<span style="color: #d1f1a9;">lambda</span> (x)
               (<span style="color: #d1f1a9;">let</span> ((log1000 (log 1000)))
                 (average (/ log1000 (log x))
                          x)))
             10.0)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">1.31</span> Exercise 1.37</h3>
<div class="outline-text-3" id="text-1-31">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac</span> N D k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac-recur</span> i)
    (<span style="color: #d1f1a9;">if</span> (&gt; i k)
        0
        (/ (N i) (+ (D i)
                    (cont-frac-recur (+ i 1))))))
  (cont-frac-recur 1))

(/ 1 (cont-frac (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                100))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac</span> N D k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac-iter</span> i result)
    (<span style="color: #d1f1a9;">if</span> (= i 1)
        result
        (cont-frac-iter (- i 1)
                        (/ (N i) (+ (D i) result)))))
  (cont-frac-iter k 0))

(/ 1 (cont-frac (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                100))
</pre>
</div>

<p>
CPS iteration<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">identity</span> x) x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac</span> N D k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac-cps</span> i f)
    (<span style="color: #d1f1a9;">if</span> (&gt; i k)
        (f 0)
        (cont-frac-cps (+ i 1)
                       (<span style="color: #d1f1a9;">lambda</span> (x)
                         (f (/ (N i)
                               (+ (D i) x)))))))
  (cont-frac-cps 1 identity))

(/ 1 (cont-frac (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                100))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">1.32</span> Exercise 1.38</h3>
<div class="outline-text-3" id="text-1-32">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">identity</span> x) x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac</span> N D k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac-cps</span> i f)
    (<span style="color: #d1f1a9;">if</span> (&gt; i k)
        (f 0)
        (cont-frac-cps (+ i 1)
                       (<span style="color: #d1f1a9;">lambda</span> (x)
                         (f (/ (N i)
                               (+ (D i) x)))))))
  (cont-frac-cps 1 identity))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">D</span> i)
  (<span style="color: #d1f1a9;">if</span> (= (remainder i 3) 2)
      (* 2 (ceiling-quotient i 3))
      1))

(+ 2 (cont-frac (<span style="color: #d1f1a9;">lambda</span> (i) 1.0)
                D
                100))
</pre>
</div>
</div>
</div>
