_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.39
#+BEGIN_SRC scheme
  (define (identity x) x)

  (define (cont-frac N D k)
    (define (cont-frac-cps i f)
      (if (> i k)
          (f 0)
          (cont-frac-cps (+ i 1)
                         (lambda (x)
                           (f (/ (N i)
                                 (+ (D i) x)))))))
    (cont-frac-cps 1 identity))

  (define (tan-cf x k)
    (define (D i)
      (- (* i 2) 1))
    (define (N i)
      (if (= i 1)
          x
          (- (* x x))))
    (cont-frac N D k))

  (list (tan-cf (/ 3.1415926 4) 100)
        (tan (/ 3.1415926 4)))

#+END_SRC

#+RESULTS:
| 0.9999999732051038 | 0.9999999732051039 |

** Exercise 1.40
#+BEGIN_SRC scheme
  (define tolerance 0.00001)

  (define (fixed-point f guess)
    (let ((next-guess (f guess)))
      (begin (display next-guess)
             (newline)
             (if (> tolerance
                    (abs (- guess next-guess)))
                 next-guess
                 (fixed-point f next-guess)))))

  (define dx 0.00001)

  (define (deriv g)
    (lambda (x)
      (/ (- (g (+ x dx)) (g x))
         dx)))

  (define (newton-transform g)
    (lambda (x)
      (- x (/ (g x) ((deriv g) x)))))

  (define (newton-method g guess)
    (fixed-point (newton-transform g) guess))

  (define (cubic a b c)
    (lambda (x) (+ (* x x x)
                   (* a x x)
                   (* b x)
                   (* c))))

  (define (polynomial a b c)
    (newton-method (cubic a b c) 1))

  (polynomial 0 0 1)
#+END_SRC

#+RESULTS:
: -0.9999999999999863

** Exercise 1.41
#+BEGIN_SRC scheme
  (define (double f)
    (lambda (x) (f (f x))))

  (define (inc x)
    (+ x 1))

  (((double (double double)) inc) 5) #|(double (double (double (double inc))))|#
#+END_SRC

#+RESULTS:
: 21

** Exercise 1.42
#+BEGIN_SRC scheme
  (define (compose f g)
    (lambda (x)
      (f (g x))))

  (define (square x)
    (* x x))

  (define (inc x)
    (+ x 1))

  ((compose square inc) 6)
#+END_SRC

#+RESULTS:
: 49

** Exercise 1.43
#+BEGIN_SRC scheme
  (define (id x)
    x)

  (define (repeated f n)
    (define (repeated-iter fsum i)
      (cond ((= n 0) id)
            ((= i n) fsum)
            (else (repeated-iter (lambda (x) (f (fsum x)))
                                 (+ i 1)))))
    (repeated-iter id 0))

  (define (square x)
    (* x x))

  ((repeated square 2) 5)
#+END_SRC

#+RESULTS:
: 625

** Exercise 1.44
#+BEGIN_SRC scheme
  (define (id x)
    x)

  (define (repeated f n)
    (define (repeated-iter fsum i)
      (cond ((= n 0) id)
            ((= i n) fsum)
            (else (repeated-iter (lambda (x) (f (fsum x)))
                                 (+ i 1)))))
    (repeated-iter id 0))

  (define epsonlon 0.00001)

  (define (smooth f)
    (lambda (x)
      (/ (+ (f (- x epsonlon)) (f x) (f (+ x epsonlon))) 3)))

  (define (repeated-smooth f n)
    ((repeated smooth n) f))

  (define (square x)
    (* x x))

  ((repeated-smooth square 5) 5)
#+END_SRC

#+RESULTS:
: 25.00000000033333

** Exercise 1.45
#+BEGIN_SRC scheme
  (define (id x) x)

  (define tolerance 0.00001)

  (define (repeated f n)
    (define (repeated-iter fsum i)
      (cond ((= n 0) id)
            ((= i n) fsum)
            (else (repeated-iter (lambda (x) (f (fsum x)))
                                 (+ i 1)))))
    (repeated-iter id 0))

  (define (average x y)
    (/ (+ x y)
       2))

  (define (average-damp f)
    (lambda (x) (average x (f x))))

  (define (average-n-times f n)
    ((repeated average-damp n) f))

  (define (power x n)
    (define (power-iter i acc)
      (if (= i n)
          acc
          (power-iter (+ i 1) (* acc x))))
    (power-iter 0 1))

  (define (lg2 n)
    (define (lg2-iter acc remain)
      (if (< remain 1)
          acc
          (lg2-iter (+ acc 1) (/ remain 2))))
    (lg2-iter 0 (/ n 2)))

  (define (n-th-root n x)
    (define (fixed-point f guess)
      (define next-guess ((average-n-times f (lg2 n)) guess))
      (display next-guess)
      (newline)
      (if (> tolerance (abs (- guess next-guess)))
          next-guess
          (fixed-point f next-guess)))
    (define (f y) (/ x (power y (- n 1))))
    (fixed-point f 1.0))

  (define (square x)
    (* x x))

  (n-th-root 5 32)
#+END_SRC

#+RESULTS:
: 2.0000015129957607

