_posts/2015-11-10-SICP_Exercise_Results.org.html
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">1.33</span> Exercise 1.39</h3>
<div class="outline-text-3" id="text-1-33">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">identity</span> x) x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac</span> N D k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cont-frac-cps</span> i f)
    (<span style="color: #d1f1a9;">if</span> (&gt; i k)
        (f 0)
        (cont-frac-cps (+ i 1)
                       (<span style="color: #d1f1a9;">lambda</span> (x)
                         (f (/ (N i)
                               (+ (D i) x)))))))
  (cont-frac-cps 1 identity))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">tan-cf</span> x k)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">D</span> i)
    (- (* i 2) 1))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">N</span> i)
    (<span style="color: #d1f1a9;">if</span> (= i 1)
        x
        (- (* x x))))
  (cont-frac N D k))

(list (tan-cf (/ 3.1415926 4) 100)
      (tan (/ 3.1415926 4)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">1.34</span> Exercise 1.40</h3>
<div class="outline-text-3" id="text-1-34">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">tolerance</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point</span> f guess)
  (<span style="color: #d1f1a9;">let</span> ((next-guess (f guess)))
    (<span style="color: #d1f1a9;">begin</span> (display next-guess)
           (newline)
           (<span style="color: #d1f1a9;">if</span> (&gt; tolerance
                  (abs (- guess next-guess)))
               next-guess
               (fixed-point f next-guess)))))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">dx</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">deriv</span> g)
  (<span style="color: #d1f1a9;">lambda</span> (x)
    (/ (- (g (+ x dx)) (g x))
       dx)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">newton-transform</span> g)
  (<span style="color: #d1f1a9;">lambda</span> (x)
    (- x (/ (g x) ((deriv g) x)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">newton-method</span> g guess)
  (fixed-point (newton-transform g) guess))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cubic</span> a b c)
  (<span style="color: #d1f1a9;">lambda</span> (x) (+ (* x x x)
                 (* a x x)
                 (* b x)
                 (* c))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">polynomial</span> a b c)
  (newton-method (cubic a b c) 1))

(polynomial 0 0 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">1.35</span> Exercise 1.41</h3>
<div class="outline-text-3" id="text-1-35">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">double</span> f)
  (<span style="color: #d1f1a9;">lambda</span> (x) (f (f x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

(((double (double double)) inc) 5) <span style="color: #7285b7; font-style: italic;">#|(double (double (double (double inc))))|#</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">1.36</span> Exercise 1.42</h3>
<div class="outline-text-3" id="text-1-36">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">compose</span> f g)
  (<span style="color: #d1f1a9;">lambda</span> (x)
    (f (g x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x)
  (* x x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">inc</span> x)
  (+ x 1))

((compose square inc) 6)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">1.37</span> Exercise 1.43</h3>
<div class="outline-text-3" id="text-1-37">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x)
  x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated</span> f n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated-iter</span> fsum i)
    (<span style="color: #d1f1a9;">cond</span> ((= n 0) id)
          ((= i n) fsum)
          (<span style="color: #d1f1a9;">else</span> (repeated-iter (<span style="color: #d1f1a9;">lambda</span> (x) (f (fsum x)))
                               (+ i 1)))))
  (repeated-iter id 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x)
  (* x x))

((repeated square 2) 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">1.38</span> Exercise 1.44</h3>
<div class="outline-text-3" id="text-1-38">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x)
  x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated</span> f n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated-iter</span> fsum i)
    (<span style="color: #d1f1a9;">cond</span> ((= n 0) id)
          ((= i n) fsum)
          (<span style="color: #d1f1a9;">else</span> (repeated-iter (<span style="color: #d1f1a9;">lambda</span> (x) (f (fsum x)))
                               (+ i 1)))))
  (repeated-iter id 0))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">epsonlon</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">smooth</span> f)
  (<span style="color: #d1f1a9;">lambda</span> (x)
    (/ (+ (f (- x epsonlon)) (f x) (f (+ x epsonlon))) 3)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated-smooth</span> f n)
  ((repeated smooth n) f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x)
  (* x x))

((repeated-smooth square 5) 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">1.39</span> Exercise 1.45</h3>
<div class="outline-text-3" id="text-1-39">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">tolerance</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated</span> f n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">repeated-iter</span> fsum i)
    (<span style="color: #d1f1a9;">cond</span> ((= n 0) id)
          ((= i n) fsum)
          (<span style="color: #d1f1a9;">else</span> (repeated-iter (<span style="color: #d1f1a9;">lambda</span> (x) (f (fsum x)))
                               (+ i 1)))))
  (repeated-iter id 0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average</span> x y)
  (/ (+ x y)
     2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average-damp</span> f)
  (<span style="color: #d1f1a9;">lambda</span> (x) (average x (f x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average-n-times</span> f n)
  ((repeated average-damp n) f))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">power</span> x n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">power-iter</span> i acc)
    (<span style="color: #d1f1a9;">if</span> (= i n)
        acc
        (power-iter (+ i 1) (* acc x))))
  (power-iter 0 1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">lg2</span> n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">lg2-iter</span> acc remain)
    (<span style="color: #d1f1a9;">if</span> (&lt; remain 1)
        acc
        (lg2-iter (+ acc 1) (/ remain 2))))
  (lg2-iter 0 (/ n 2)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">n-th-root</span> n x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point</span> f guess)
    (<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">next-guess</span> ((average-n-times f (lg2 n)) guess))
    (display next-guess)
    (newline)
    (<span style="color: #d1f1a9;">if</span> (&gt; tolerance (abs (- guess next-guess)))
        next-guess
        (fixed-point f next-guess)))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span> y) (/ x (power y (- n 1))))
  (fixed-point f 1.0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x)
  (* x x))

(n-th-root 5 32)
</pre>
</div>
</div>
</div>
