_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 1.46
#+BEGIN_SRC scheme
  (define (abs x)
    (if (< x 0)
        (- x)
        x))

  (define (iterative-improve good-enough? update-guess)
    (define (iter-func guess)
      (let ((last-guess guess)
            (updated-guess (update-guess guess)))
        (if (good-enough? updated-guess last-guess)
            updated-guess
            (iter-func updated-guess))))
    iter-func)

  (define (sqrt n)
    (define (sqrt-good-enough? guess last-guess)
      (if (< (abs (- (/ guess last-guess) 1)) 0.00001) #t #f))
    (define (sqrt-update-guess guess)
      (/ (+ guess (/ n guess)) 2))
    ((iterative-improve sqrt-good-enough? sqrt-update-guess) 2.0))

  (sqrt 100)
#+END_SRC

#+RESULTS:
: 10.000000000107445

#+BEGIN_SRC scheme
  (define (f)
    (define (g x y) (+ x y))
    (lambda (x y) (g x y)))

  ((f) 33 44)
#+END_SRC

#+RESULTS:
: 77


#+BEGIN_SRC scheme
  (define (iterative-improve good-enough? update-guess)
    (define (iter-func guess)
      (let ((last-guess guess)
            (updated-guess (update-guess guess)))
        (if (good-enough? updated-guess last-guess)
            updated-guess
            (iter-func updated-guess))))
    (lambda (guess) (iter-func guess)))

  (define tolerance 0.00001)

  (define (fixed-point f guess)
    (define (fixed-point-good-enough? guess last-guess)
      (> tolerance (abs (- last-guess guess))))
    (define (fixed-point-update-guess guess)
      (f guess))
    ((iterative-improve fixed-point-good-enough? fixed-point-update-guess) guess))

  (define (average x y)
    (/ (+ x y) 2))

  (define (sqrt x)
    (fixed-point (lambda (y) (average y (/ x y))) 2.0))

  (sqrt 100)
#+END_SRC

#+RESULTS:
: 10.0

* Building Abstractions with Data
** Exercise 2.1
#+BEGIN_SRC scheme
  (define (make-rat n d)
    (define (assign x)
      (if (> x 0)
          1
          -1))
    (let ((g (gcd n d))
          (n (abs n))
          (d (abs d))
          (a (assign (* n d))))
      (cons (* (/ n g) a) (/ d g))))

  (define (numer x) (car x))

  (define (denom x) (cdr x))

  (define (print-rat x)
    (newline)
    (display (numer x))
    (display "/")
    (display (denom x)))

  (define num (make-rat 4 -8))

  (print-rat num)

  num
#+END_SRC

#+RESULTS:
: (-1 . 2)

** COMMENT Exercise 2.2
#+BEGIN_SRC scheme
  #| Point Definiation |#
  (define (make-point x y)
    (cons x y))

  (define (x-point x)
    (car x))

  (define (y-point x)
    (cdr x))

  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ", ")
    (display (y-point p))
    (display ")"))

  #| Segment Definiation |#
  (define (make-segment x y)
    (cons x y))

  (define (start-segment x)
    (car x))

  (define (end-segment x)
    (cdr x))

  #| Implementation |#

  (define (average x y)
    (/ (+ x y) 2))

  (define (midpoint-segment s)
    (let ((p1 (start-segment s))
          (p2 (end-segment s)))
      (make-point (average (x-point p1) (x-point p2))
                  (average (y-point p1) (y-point p2)))))

  (define s (make-segment (make-point 10 20)
                          (make-point 0 0)))

  (print-point (midpoint-segment s))
#+END_SRC

#+RESULTS:
: ((10 . 20) 0 . 0)

