_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">1.40</span> Exercise 1.46</h3>
<div class="outline-text-3" id="text-1-40">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">abs</span> x)
  (<span style="color: #d1f1a9;">if</span> (&lt; x 0)
      (- x)
      x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iterative-improve</span> good-enough? update-guess)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter-func</span> guess)
    (<span style="color: #d1f1a9;">let</span> ((last-guess guess)
          (updated-guess (update-guess guess)))
      (<span style="color: #d1f1a9;">if</span> (good-enough? updated-guess last-guess)
          updated-guess
          (iter-func updated-guess))))
  iter-func)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sqrt</span> n)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sqrt-good-enough?</span> guess last-guess)
    (<span style="color: #d1f1a9;">if</span> (&lt; (abs (- (/ guess last-guess) 1)) 0.00001) #t #f))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sqrt-update-guess</span> guess)
    (/ (+ guess (/ n guess)) 2))
  ((iterative-improve sqrt-good-enough? sqrt-update-guess) 2.0))

(sqrt 100)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span>)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">g</span> x y) (+ x y))
  (<span style="color: #d1f1a9;">lambda</span> (x y) (g x y)))

((f) 33 44)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iterative-improve</span> good-enough? update-guess)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter-func</span> guess)
    (<span style="color: #d1f1a9;">let</span> ((last-guess guess)
          (updated-guess (update-guess guess)))
      (<span style="color: #d1f1a9;">if</span> (good-enough? updated-guess last-guess)
          updated-guess
          (iter-func updated-guess))))
  (<span style="color: #d1f1a9;">lambda</span> (guess) (iter-func guess)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">tolerance</span> 0.00001)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point</span> f guess)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point-good-enough?</span> guess last-guess)
    (&gt; tolerance (abs (- last-guess guess))))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fixed-point-update-guess</span> guess)
    (f guess))
  ((iterative-improve fixed-point-good-enough? fixed-point-update-guess) guess))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average</span> x y)
  (/ (+ x y) 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sqrt</span> x)
  (fixed-point (<span style="color: #d1f1a9;">lambda</span> (y) (average y (/ x y))) 2.0))

(sqrt 100)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline79" class="outline-2">
<h2 id="orgheadline79"><span class="section-number-2">2</span> Building Abstractions with Data</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">2.1</span> Exercise 2.1</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-rat</span> n d)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">assign</span> x)
    (<span style="color: #d1f1a9;">if</span> (&gt; x 0)
        1
        -1))
  (<span style="color: #d1f1a9;">let</span> ((g (gcd n d))
        (n (abs n))
        (d (abs d))
        (a (assign (* n d))))
    (cons (* (/ n g) a) (/ d g))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">numer</span> x) (car x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">denom</span> x) (cdr x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">print-rat</span> x)
  (newline)
  (display (numer x))
  (display <span style="color: #99ffff;">"/"</span>)
  (display (denom x)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">num</span> (make-rat 4 -8))

(print-rat num)

num
</pre>
</div>
</div>
</div>
