_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.3
#+BEGIN_SRC scheme
  #| Utils |#
  (define (average x y)
    (/ (+ x y) 2))

  #| Point Definiation |#
  (define (make-point x y)
    (cons x y))

  (define (x-point x)
    (car x))

  (define (y-point x)
    (cdr x))

  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ", ")
    (display (y-point p))
    (display ")"))

  #| Segment Definiation |#
  (define (make-segment x y)
    (cons x y))

  (define (start-segment x)
    (car x))

  (define (end-segment x)
    (cdr x))


  (define (midpoint-segment s)
    (let ((p1 (start-segment s))
          (p2 (end-segment s)))
      (make-point (average (x-point p1) (x-point p2))
                  (average (y-point p1) (y-point p2)))))

  #| Point Rect Definiation |#
  (define (make-point-rect p1 p2)
    (cons p1 p2))

  (define (height-rect r)
    (abs (- (y-point (car r))
            (y-point (cdr r)))))

  (define (width-rect r)
    (abs (- (x-point (car r))
            (x-point (cdr r)))))

  #| Implementation |#
  (define (perimeter-rect r)
    (* 2 (+ (height-rect r)
            (width-rect r))))

  (define (area-rect r)
    (* (height-rect r)
       (width-rect r)))

  (define rect (make-point-rect (make-point -1 1)
                                (make-point 5 -8)))

  (list (perimeter-rect rect)
        (area-rect rect))
#+END_SRC

#+RESULTS:
| 30 | 54 |

#+BEGIN_SRC scheme
  #| Utils |#
  (define (average x y)
    (/ (+ x y) 2))

  #| Point Definiation |#
  (define (make-point x y)
    (cons x y))

  (define (x-point x)
    (car x))

  (define (y-point x)
    (cdr x))

  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ", ")
    (display (y-point p))
    (display ")"))

  #| Segment Definiation |#
  (define (make-segment x y)
    (cons x y))

  (define (start-segment x)
    (car x))

  (define (end-segment x)
    (cdr x))


  (define (midpoint-segment s)
    (let ((p1 (start-segment s))
          (p2 (end-segment s)))
      (make-point (average (x-point p1) (x-point p2))
                  (average (y-point p1) (y-point p2)))))

  #| Point Rect Definiation |#
  (define (make-pwh-rect p1 width height)
    (cons p1 (cons width height)))

  (define (height-rect r)
    (cdr (cdr r)))

  (define (width-rect r)
    (car (cdr r)))

  #| Implementation |#
  (define (perimeter-rect r)
    (* 2 (+ (height-rect r)
            (width-rect r))))

  (define (area-rect r)
    (* (height-rect r)
       (width-rect r)))

  (define rect (make-pwh-rect (make-point -1 1)
                              6
                              9))

  (list (perimeter-rect rect)
        (area-rect rect))

#+END_SRC

#+RESULTS:
| 30 | 54 |

** Exercise 2.4
Church Encoding
#+BEGIN_SRC scheme
  (define (cons x y)
    (lambda (m) (m x y)))

  (define (car pair)
    (pair (lambda (x y) x)))

  (define (cdr pair)
    (pair (lambda (x y) y)))
#+END_SRC

** Exercise 2.5
#+BEGIN_SRC scheme
  (define (cons x y)
    (* (expt 2 x) (expt 3 y)))

  (define (integer-log x y)
    (define (id x) x)
    (define (integer-log-iter x f)
      (let ((quot (/ x y)))
        (if (integer? quot)
            (integer-log-iter quot (lambda (x) (f (+ x 1))))
            (f 0))))
    (integer-log-iter x id))

  (define (car x)
    (integer-log x 2))

  (define (cdr x)
    (integer-log x 3))

  (define pair (cons 2 3))

  (list pair
        (car pair)
        (cdr pair))
#+END_SRC

#+RESULTS:
| 108 | 2 | 3 |

** Exercise 2.6
#+BEGIN_SRC scheme
  (define zero
    (lambda (f) (lambda (x) x)))

  (define (add-1 n)
    (lambda (f) (lambda (x) (f ((n f) x)))))

  (define one
    (lambda (f) (lambda (x) (f x))))

  (define two
    (lambda (f) (lambda (x) (f (f x)))))

  (define (add a b)
    (lambda (f) (lambda (x)
                  ((b f) ((a f) x)))))
#+END_SRC

