_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">2.2</span> Exercise 2.3</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #7285b7; font-style: italic;">#| Utils |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average</span> x y)
  (/ (+ x y) 2))

<span style="color: #7285b7; font-style: italic;">#| Point Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-point</span> x y)
  (cons x y))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">x-point</span> x)
  (car x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">y-point</span> x)
  (cdr x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">print-point</span> p)
  (newline)
  (display <span style="color: #99ffff;">"("</span>)
  (display (x-point p))
  (display <span style="color: #99ffff;">", "</span>)
  (display (y-point p))
  (display <span style="color: #99ffff;">")"</span>))

<span style="color: #7285b7; font-style: italic;">#| Segment Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-segment</span> x y)
  (cons x y))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-segment</span> x)
  (car x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">end-segment</span> x)
  (cdr x))


(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">midpoint-segment</span> s)
  (<span style="color: #d1f1a9;">let</span> ((p1 (start-segment s))
        (p2 (end-segment s)))
    (make-point (average (x-point p1) (x-point p2))
                (average (y-point p1) (y-point p2)))))

<span style="color: #7285b7; font-style: italic;">#| Point Rect Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-point-rect</span> p1 p2)
  (cons p1 p2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">height-rect</span> r)
  (abs (- (y-point (car r))
          (y-point (cdr r)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">width-rect</span> r)
  (abs (- (x-point (car r))
          (x-point (cdr r)))))

<span style="color: #7285b7; font-style: italic;">#| Implementation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">perimeter-rect</span> r)
  (* 2 (+ (height-rect r)
          (width-rect r))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">area-rect</span> r)
  (* (height-rect r)
     (width-rect r)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">rect</span> (make-point-rect (make-point -1 1)
                              (make-point 5 -8)))

(list (perimeter-rect rect)
      (area-rect rect))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #7285b7; font-style: italic;">#| Utils |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">average</span> x y)
  (/ (+ x y) 2))

<span style="color: #7285b7; font-style: italic;">#| Point Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-point</span> x y)
  (cons x y))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">x-point</span> x)
  (car x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">y-point</span> x)
  (cdr x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">print-point</span> p)
  (newline)
  (display <span style="color: #99ffff;">"("</span>)
  (display (x-point p))
  (display <span style="color: #99ffff;">", "</span>)
  (display (y-point p))
  (display <span style="color: #99ffff;">")"</span>))

<span style="color: #7285b7; font-style: italic;">#| Segment Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-segment</span> x y)
  (cons x y))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">start-segment</span> x)
  (car x))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">end-segment</span> x)
  (cdr x))


(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">midpoint-segment</span> s)
  (<span style="color: #d1f1a9;">let</span> ((p1 (start-segment s))
        (p2 (end-segment s)))
    (make-point (average (x-point p1) (x-point p2))
                (average (y-point p1) (y-point p2)))))

<span style="color: #7285b7; font-style: italic;">#| Point Rect Definiation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-pwh-rect</span> p1 width height)
  (cons p1 (cons width height)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">height-rect</span> r)
  (cdr (cdr r)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">width-rect</span> r)
  (car (cdr r)))

<span style="color: #7285b7; font-style: italic;">#| Implementation |#</span>
(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">perimeter-rect</span> r)
  (* 2 (+ (height-rect r)
          (width-rect r))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">area-rect</span> r)
  (* (height-rect r)
     (width-rect r)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">rect</span> (make-pwh-rect (make-point -1 1)
                            6
                            9))

(list (perimeter-rect rect)
      (area-rect rect))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">2.3</span> Exercise 2.4</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Church Encoding<br  />
</p>
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cons</span> x y)
  (<span style="color: #d1f1a9;">lambda</span> (m) (m x y)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">car</span> pair)
  (pair (<span style="color: #d1f1a9;">lambda</span> (x y) x)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cdr</span> pair)
  (pair (<span style="color: #d1f1a9;">lambda</span> (x y) y)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">2.4</span> Exercise 2.5</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cons</span> x y)
  (* (expt 2 x) (expt 3 y)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">integer-log</span> x y)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">integer-log-iter</span> x f)
    (<span style="color: #d1f1a9;">let</span> ((quot (/ x y)))
      (<span style="color: #d1f1a9;">if</span> (integer? quot)
          (integer-log-iter quot (<span style="color: #d1f1a9;">lambda</span> (x) (f (+ x 1))))
          (f 0))))
  (integer-log-iter x id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">car</span> x)
  (integer-log x 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cdr</span> x)
  (integer-log x 3))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">pair</span> (cons 2 3))

(list pair
      (car pair)
      (cdr pair))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">2.5</span> Exercise 2.6</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">zero</span>
  (<span style="color: #d1f1a9;">lambda</span> (f) (<span style="color: #d1f1a9;">lambda</span> (x) x)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">add-1</span> n)
  (<span style="color: #d1f1a9;">lambda</span> (f) (<span style="color: #d1f1a9;">lambda</span> (x) (f ((n f) x)))))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">one</span>
  (<span style="color: #d1f1a9;">lambda</span> (f) (<span style="color: #d1f1a9;">lambda</span> (x) (f x))))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">two</span>
  (<span style="color: #d1f1a9;">lambda</span> (f) (<span style="color: #d1f1a9;">lambda</span> (x) (f (f x)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">add</span> a b)
  (<span style="color: #d1f1a9;">lambda</span> (f) (<span style="color: #d1f1a9;">lambda</span> (x)
                ((b f) ((a f) x)))))
</pre>
</div>
</div>
</div>
