_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.7, 2.8, 2.9, 2.10, 2.11. 2.12, 2.13, 2.14, (2.15, 2.16)
#+BEGIN_SRC scheme
  #| Definition |#

  (define (make-interval lower-bound upper-bound)
    (cons lower-bound upper-bound))

  (define (make-center-percent c pw)
    (make-center-width c (* c pw)))

  (define (make-center-width c w)
    (make-interval (- c w) (+ c w)))

  (define (lower-bound x)
    (min (car x) (cdr x)))

  (define (upper-bound x)
    (max (car x) (cdr x)))

  (define (interval-center x)
    (/ (+ (lower-bound x) (upper-bound x)) 2))

  (define (interval-width x)
    (/ (- (upper-bound x) (lower-bound x)) 2.0))

  (define (interval-percent x)
    (/ (* 100 (interval-width x)) (interval-center x)))

  (define (mul-interval-rough-percent x y)
    (+ (interval-percent x) (interval-percent y)))

  (define (state x)
    (if (> (* (upper-bound x) (lower-bound x)) 0)
        (if (> (lower-bound x) 0)
            1
            -1)
        0))

  (define (add-interval x y)
    (make-interval (+ (lower-bound x) (lower-bound y))
                   (+ (upper-bound x) (upper-bound y))))

  (define (sub-interval x y)
    (make-interval (- (lower-bound x) (upper-bound y))
                   (- (upper-bound x) (lower-bound y))))

  (define (mul-interval-1 x y)
    (let ((p1 (* (lower-bound x) (lower-bound y)))
          (p2 (* (lower-bound x) (upper-bound y)))
          (p3 (* (upper-bound x) (lower-bound y)))
          (p4 (* (upper-bound x) (upper-bound y))))
      (make-interval (min p1 p2 p3 p4)
                     (max p1 p2 p3 p4))))

  (define (mul-interval x y)
    (let ((x0 (lower-bound x))
          (x1 (upper-bound x))
          (y0 (lower-bound y))
          (y1 (upper-bound y))
          (xs (state x))
          (ys (state y)))
      (cond ((and (> xs 0) (> ys 0))
             (make-interval (* x0 y0) (* x1 y1)))
            ((and (> xs 0) (< ys 0))
             (make-interval (* x1 y0) (* x0 y1)))
            ((and (> xs 0) (= ys 0))
             (make-interval (* x1 y0) (* x1 y1)))
            ((and (< xs 0) (> ys 0))
             (make-interval (* x0 y1) (* x1 y0)))
            ((and (< xs 0) (< ys 0))
             (make-interval (* x1 y1) (* x0 y0)))
            ((and (< xs 0) (= ys 0))
             (make-interval (* x1 y1) (* x0 y0)))
            ((and (= xs 0) (> ys 0))
             (make-interval (* x0 y1) (* x1 y1)))
            ((and (= xs 0) (< ys 0))
             (make-interval (* x1 y0) (* x0 y1)))
            ((and (= xs 0) (= ys 0))
             (make-interval (min (* x0 y1) (* x1 y0)) (max (* x0 y0) (* x1 y1)))))))

  (define (div-interval x y)
    (if (not (= (state y) 0))
        (mul-interval x
                      (make-interval (/ 1.0 (upper-bound y))
                                     (/ 1.0 (lower-bound y))))
        (throw 'cross-zero "Divided a cross-zero-interval!")))

  #| Test |#
  (define x1 (make-interval -1 3))
  (define x2 (make-interval -2 4))
  (define x3 (make-interval 2 4))
  (define x4 (make-center-percent 10 0.03))
  (define x5 (make-center-percent 5 0.001))
  (define x6 (make-interval 1000 1001))
  (define x7 (make-interval 2000 2005))


  (define (show-bool bool)
    (if bool "true"  "false"))

  (list (add-interval x1 x2)
        (sub-interval x1 x2)
        (mul-interval x1 x2)
        (catch 'cross-zero
          (lambda () (div-interval x1 x2))
          (lambda (key arg) (display arg) "NAN"))
        (div-interval x1 x3)
        (show-bool (= (interval-width (add-interval x1 x2))
                      (+ (interval-width x1) (interval-width x2))))
        (show-bool (= (interval-width (sub-interval x1 x2))
                      (+ (interval-width x1) (interval-width x2))))
        (abs (- (interval-percent (mul-interval x1 x2)) (mul-interval-rough-percent x1 x2)))
        (abs (- (interval-percent (mul-interval x4 x5)) (mul-interval-rough-percent x4 x5)))
        (interval-percent x6)
        (interval-percent (add-interval x6 x6))
        (sub-interval x6 x6)
        (interval-percent (mul-interval x6 x6))
        (interval-percent (div-interval x6 x6))
        (interval-percent (div-interval x6 x7)))
#+END_SRC

#+RESULTS:
: ((-3 . 7) (-5 . 5) (-6 . 12) NAN (-0.5 . 1.5) true true 200.0 9.299721008027007e-05 0.04997501249375312 0.04997501249375312 (-1 . 1) 0.09995000002497502 0.0999500000249789 0.17481884849158807)

** Exercise 2.17
#+BEGIN_SRC scheme
  (define (last-pair list)
    (let ((tail (cdr list)))
      (if (null? tail)
          (car list)
          (last-pair tail))))

  (last-pair (list 1 2 3 4))
#+END_SRC

#+RESULTS:
: 4

** Exercise 2.18
#+BEGIN_SRC scheme
  (define (reverse li)
    (define (reverse-iter src dst)
      (if (null? src)
          dst
          (reverse-iter (cdr src) (cons (car src) dst))))
    (reverse-iter li (list)))

  (reverse (list 1 2 3 4))
#+END_SRC

#+RESULTS:
| 4 | 3 | 2 | 1 |

** Exercise 2.19
#+BEGIN_SRC scheme
  (define (cc amount coin-values)
    (cond ((= amount 0) 1)
          ((or (< amount 0) (no-more? coin-values)) 0)
          (else
           (+ (cc amount
                  (except-first-denomination coin-values))
              (cc (- amount (first-denomination coin-values)) coin-values)))))

  (define no-more? null?)

  (define first-denomination car)

  (define except-first-denomination cdr)

  (define us-coins (list 50 25 10 5 1))

  (define uk-coins (list 100 50 20 10 5 2 1 0.5))

  (cc 100 us-coins)
#+END_SRC

#+RESULTS:
: 292

