_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">2.6</span> Exercise 2.7, 2.8, 2.9, 2.10, 2.11. 2.12, 2.13, 2.14, (2.15, 2.16)</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #7285b7; font-style: italic;">#| Definition |#</span>

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-interval</span> lower-bound upper-bound)
  (cons lower-bound upper-bound))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-center-percent</span> c pw)
  (make-center-width c (* c pw)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-center-width</span> c w)
  (make-interval (- c w) (+ c w)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">lower-bound</span> x)
  (min (car x) (cdr x)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">upper-bound</span> x)
  (max (car x) (cdr x)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">interval-center</span> x)
  (/ (+ (lower-bound x) (upper-bound x)) 2))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">interval-width</span> x)
  (/ (- (upper-bound x) (lower-bound x)) 2.0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">interval-percent</span> x)
  (/ (* 100 (interval-width x)) (interval-center x)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mul-interval-rough-percent</span> x y)
  (+ (interval-percent x) (interval-percent y)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">state</span> x)
  (<span style="color: #d1f1a9;">if</span> (&gt; (* (upper-bound x) (lower-bound x)) 0)
      (<span style="color: #d1f1a9;">if</span> (&gt; (lower-bound x) 0)
          1
          -1)
      0))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">add-interval</span> x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
                 (+ (upper-bound x) (upper-bound y))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">sub-interval</span> x y)
  (make-interval (- (lower-bound x) (upper-bound y))
                 (- (upper-bound x) (lower-bound y))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mul-interval-1</span> x y)
  (<span style="color: #d1f1a9;">let</span> ((p1 (* (lower-bound x) (lower-bound y)))
        (p2 (* (lower-bound x) (upper-bound y)))
        (p3 (* (upper-bound x) (lower-bound y)))
        (p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
                   (max p1 p2 p3 p4))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mul-interval</span> x y)
  (<span style="color: #d1f1a9;">let</span> ((x0 (lower-bound x))
        (x1 (upper-bound x))
        (y0 (lower-bound y))
        (y1 (upper-bound y))
        (xs (state x))
        (ys (state y)))
    (<span style="color: #d1f1a9;">cond</span> ((<span style="color: #d1f1a9;">and</span> (&gt; xs 0) (&gt; ys 0))
           (make-interval (* x0 y0) (* x1 y1)))
          ((<span style="color: #d1f1a9;">and</span> (&gt; xs 0) (&lt; ys 0))
           (make-interval (* x1 y0) (* x0 y1)))
          ((<span style="color: #d1f1a9;">and</span> (&gt; xs 0) (= ys 0))
           (make-interval (* x1 y0) (* x1 y1)))
          ((<span style="color: #d1f1a9;">and</span> (&lt; xs 0) (&gt; ys 0))
           (make-interval (* x0 y1) (* x1 y0)))
          ((<span style="color: #d1f1a9;">and</span> (&lt; xs 0) (&lt; ys 0))
           (make-interval (* x1 y1) (* x0 y0)))
          ((<span style="color: #d1f1a9;">and</span> (&lt; xs 0) (= ys 0))
           (make-interval (* x1 y1) (* x0 y0)))
          ((<span style="color: #d1f1a9;">and</span> (= xs 0) (&gt; ys 0))
           (make-interval (* x0 y1) (* x1 y1)))
          ((<span style="color: #d1f1a9;">and</span> (= xs 0) (&lt; ys 0))
           (make-interval (* x1 y0) (* x0 y1)))
          ((<span style="color: #d1f1a9;">and</span> (= xs 0) (= ys 0))
           (make-interval (min (* x0 y1) (* x1 y0)) (max (* x0 y0) (* x1 y1)))))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">div-interval</span> x y)
  (<span style="color: #d1f1a9;">if</span> (not (= (state y) 0))
      (mul-interval x
                    (make-interval (/ 1.0 (upper-bound y))
                                   (/ 1.0 (lower-bound y))))
      (throw 'cross-zero <span style="color: #99ffff;">"Divided a cross-zero-interval!"</span>)))

<span style="color: #7285b7; font-style: italic;">#| Test |#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x1</span> (make-interval -1 3))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x2</span> (make-interval -2 4))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x3</span> (make-interval 2 4))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x4</span> (make-center-percent 10 0.03))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x5</span> (make-center-percent 5 0.001))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x6</span> (make-interval 1000 1001))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x7</span> (make-interval 2000 2005))


(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">show-bool</span> bool)
  (<span style="color: #d1f1a9;">if</span> bool <span style="color: #99ffff;">"true"</span>  <span style="color: #99ffff;">"false"</span>))

(list (add-interval x1 x2)
      (sub-interval x1 x2)
      (mul-interval x1 x2)
      (catch 'cross-zero
        (<span style="color: #d1f1a9;">lambda</span> () (div-interval x1 x2))
        (<span style="color: #d1f1a9;">lambda</span> (key arg) (display arg) <span style="color: #99ffff;">"NAN"</span>))
      (div-interval x1 x3)
      (show-bool (= (interval-width (add-interval x1 x2))
                    (+ (interval-width x1) (interval-width x2))))
      (show-bool (= (interval-width (sub-interval x1 x2))
                    (+ (interval-width x1) (interval-width x2))))
      (abs (- (interval-percent (mul-interval x1 x2)) (mul-interval-rough-percent x1 x2)))
      (abs (- (interval-percent (mul-interval x4 x5)) (mul-interval-rough-percent x4 x5)))
      (interval-percent x6)
      (interval-percent (add-interval x6 x6))
      (sub-interval x6 x6)
      (interval-percent (mul-interval x6 x6))
      (interval-percent (div-interval x6 x6))
      (interval-percent (div-interval x6 x7)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">2.7</span> Exercise 2.17</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">last-pair</span> list)
  (<span style="color: #d1f1a9;">let</span> ((tail (cdr list)))
    (<span style="color: #d1f1a9;">if</span> (null? tail)
        (car list)
        (last-pair tail))))

(last-pair (list 1 2 3 4))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">2.8</span> Exercise 2.18</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse</span> li)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse-iter</span> src dst)
    (<span style="color: #d1f1a9;">if</span> (null? src)
        dst
        (reverse-iter (cdr src) (cons (car src) dst))))
  (reverse-iter li (list)))

(reverse (list 1 2 3 4))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline50" class="outline-3">
<h3 id="orgheadline50"><span class="section-number-3">2.9</span> Exercise 2.19</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">cc</span> amount coin-values)
  (<span style="color: #d1f1a9;">cond</span> ((= amount 0) 1)
        ((<span style="color: #d1f1a9;">or</span> (&lt; amount 0) (no-more? coin-values)) 0)
        (<span style="color: #d1f1a9;">else</span>
         (+ (cc amount
                (except-first-denomination coin-values))
            (cc (- amount (first-denomination coin-values)) coin-values)))))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">no-more?</span> null?)

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">first-denomination</span> car)

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">except-first-denomination</span> cdr)

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">us-coins</span> (list 50 25 10 5 1))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">uk-coins</span> (list 100 50 20 10 5 2 1 0.5))

(cc 100 us-coins)
</pre>
</div>
</div>
</div>
