_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.20
#+BEGIN_SRC scheme
  (define (identity x) x)

  (define (same-parity n . li)
    (define (same-parity-iter f li)
      (if (null? li)
          (f (list))
          (if (zero? (remainder (- (car li) n) 2))
              (same-parity-iter (lambda (x) (f (cons (car li) x))) (cdr li))
              (same-parity-iter f (cdr li)))))
    (cons n (same-parity-iter identity li)))

  (list (same-parity 1 3 4 5 6 7 8)
        (same-parity 2 3 4 5 6 7 8))
#+END_SRC

#+RESULTS:
| 1 | 3 | 5 | 7 |
| 2 | 4 | 6 | 8 |

** Exercise 2.21
#+BEGIN_SRC scheme
  (define (map li op)
    (define (identity x) x)
    (define (map-cps-iter src f)
      (if (null? src)
          (f (list))
          (map-cps-iter (cdr src)
                        (lambda (x)
                          (f (cons (op (car src)) x))))))
    (map-cps-iter li identity))

  (define (square-list x)
    (map x (lambda (x) (* x x))))

  (define my-list (list 1 2 3 4))

  (square-list my-list)
#+END_SRC

#+RESULTS:
| 1 | 4 | 9 | 16 |

** Exercise 2.22
#+BEGIN_SRC scheme
  (define (square-list items)
    (define (iter things answer)
      (if (null? things)
          answer
          (iter (cdr things)
                (cons answer
                      (square (car things))))))
    (iter items (list)))

  (define (square x) (* x x))

  (define my-list (list 1 2 3 4))

  (square-list my-list)
#+END_SRC

#+RESULTS:
: ((((nil . 1) . 4) . 9) . 16)

** Exercise 2.23
#+BEGIN_SRC scheme
  (define (for-each li op)
    (define (for-each-iter src)
      (if (not (null? src))
          (begin
            (op (car src))
            (for-each-iter (cdr src)))))
    (for-each-iter li))

  (define my-list (list 1 2 3 4))

  (for-each my-list (lambda (x) (newline) (display x)))
#+END_SRC

#+RESULTS:

** Exercise 2.24
#+BEGIN_SRC scheme
(list 1 (list 2 (list 3 4)))
#| (1 . (2 . (3 . 4))) |#
#+END_SRC

#+RESULTS:
| 1 | (2 (3 4)) |

** Exercise 2.25
#+BEGIN_SRC scheme
  (define l1 (list 1 3 (list 5 7) 9))
  (define l2 (list (list 7)))
  (define l3 (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7)))))))

  (list
   (car (cdr (car (cdr (cdr l1)))))
   (car (car l2))
   (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr l3)))))))))))))
#+END_SRC

#+RESULTS:
| 7 | 7 | 7 |

** Exercise 2.26
#+BEGIN_SRC scheme
  (define x (list 1 2 3))
  (define y (list 4 5 6))

  (define (append list1 list2)
    (if (null? list1)
        list2
        (cons (car list1) (append (cdr list1) list2))))

  (list
   (append x y) #|(1 2 3 4 5 6)|#
   (cons x y) #|((1 2 3) 4 5 6)|#
   (list x y) #|((1 2 3) (4 5 6))|#
   )
#+END_SRC

#+RESULTS:
| 1       |       2 | 3 | 4 | 5 | 6 |
| (1 2 3) |       4 | 5 | 6 |   |   |
| (1 2 3) | (4 5 6) |   |   |   |   |

** Exercise 2.27
#+BEGIN_SRC scheme
  (define x (list (list 1 2) (list 3 4)))

  (define (reverse li)
    (define (reverse-iter src dst)
      (if (null? src)
          dst
          (reverse-iter (cdr src) (cons (car src) dst))))
    (reverse-iter li (list)))

  (define (deep-reverse li)
    (define (reverse-iter src dst)
      (if (null? src)
          dst
          (let ((head
                 (if (pair? (car src))
                     (reverse-iter (car src) (list))
                     (car src))))
            (reverse-iter (cdr src) (cons head dst)))))
    (reverse-iter li (list)))

  (list (reverse x)
        (deep-reverse x))
#+END_SRC

#+RESULTS:
| (3 4) | (1 2) |
| (4 3) | (2 1) |

** Exercise 2.28
#+BEGIN_SRC scheme
  (define (leaf? x)
    (and (pair? x)
         (not (pair? (car x)))))

  (define (wrap? x)
    (and (pair? x)
         (null? (cdr x))
         (pair? (car x))))

  (define (append-cps x y f)
    (cond ((null? x) (f y))
          ((not (pair? x)) (f (cons x y)))
          (else (append-cps (cdr x) y (lambda (r) (f (cons (car x) r)))))))

  (define (fringe tree)
    (define (id x) x)
    (define (fringe-iter src f)
      (cond ((null? src) '())
            ((wrap? src) (fringe-iter (car src) f))
            ((leaf? src) (if (null? (cdr src))
                             (f (car src))
                             (fringe-iter (cdr src) (lambda (x) (f (cons (car src) x))))))
            (else (fringe-iter (car src) (lambda (x) (fringe-iter (cdr src)
                                                                  (lambda (y) (append-cps x y f))))))))
    (fringe-iter tree (lambda (x) (append-cps x '() id))))

  (define x (list (list 1 2) (list 3 4)))

 (fringe (list x x))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 1 | 2 | 3 | 4 |

