_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">2.10</span> Exercise 2.20</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">identity</span> x) x)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">same-parity</span> n . li)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">same-parity-iter</span> f li)
    (<span style="color: #d1f1a9;">if</span> (null? li)
        (f (list))
        (<span style="color: #d1f1a9;">if</span> (zero? (remainder (- (car li) n) 2))
            (same-parity-iter (<span style="color: #d1f1a9;">lambda</span> (x) (f (cons (car li) x))) (cdr li))
            (same-parity-iter f (cdr li)))))
  (cons n (same-parity-iter identity li)))

(list (same-parity 1 3 4 5 6 7 8)
      (same-parity 2 3 4 5 6 7 8))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">2.11</span> Exercise 2.21</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">map</span> li op)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">identity</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">map-cps-iter</span> src f)
    (<span style="color: #d1f1a9;">if</span> (null? src)
        (f (list))
        (map-cps-iter (cdr src)
                      (<span style="color: #d1f1a9;">lambda</span> (x)
                        (f (cons (op (car src)) x))))))
  (map-cps-iter li identity))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square-list</span> x)
  (<span style="color: #d1f1a9;">map</span> x (<span style="color: #d1f1a9;">lambda</span> (x) (* x x))))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">my-list</span> (list 1 2 3 4))

(square-list my-list)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">2.12</span> Exercise 2.22</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square-list</span> items)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iter</span> things answer)
    (<span style="color: #d1f1a9;">if</span> (null? things)
        answer
        (iter (cdr things)
              (cons answer
                    (square (car things))))))
  (iter items (list)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">square</span> x) (* x x))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">my-list</span> (list 1 2 3 4))

(square-list my-list)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">2.13</span> Exercise 2.23</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">for-each</span> li op)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">for-each-iter</span> src)
    (<span style="color: #d1f1a9;">if</span> (not (null? src))
        (<span style="color: #d1f1a9;">begin</span>
          (op (car src))
          (for-each-iter (cdr src)))))
  (for-each-iter li))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">my-list</span> (list 1 2 3 4))

(<span style="color: #d1f1a9;">for-each</span> my-list (<span style="color: #d1f1a9;">lambda</span> (x) (newline) (display x)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-3">
<h3 id="orgheadline55"><span class="section-number-3">2.14</span> Exercise 2.24</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">

<pre class="src src-scheme">(list 1 (list 2 (list 3 4)))
<span style="color: #7285b7; font-style: italic;">#| (1 . (2 . (3 . 4))) |#</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">2.15</span> Exercise 2.25</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">l1</span> (list 1 3 (list 5 7) 9))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">l2</span> (list (list 7)))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">l3</span> (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7)))))))

(list
 (car (cdr (car (cdr (cdr l1)))))
 (car (car l2))
 (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr l3)))))))))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">2.16</span> Exercise 2.26</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x</span> (list 1 2 3))
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">y</span> (list 4 5 6))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">append</span> list1 list2)
  (<span style="color: #d1f1a9;">if</span> (null? list1)
      list2
      (cons (car list1) (append (cdr list1) list2))))

(list
 (append x y) <span style="color: #7285b7; font-style: italic;">#|(1 2 3 4 5 6)|#</span>
 (cons x y) <span style="color: #7285b7; font-style: italic;">#|((1 2 3) 4 5 6)|#</span>
 (list x y) <span style="color: #7285b7; font-style: italic;">#|((1 2 3) (4 5 6))|#</span>
 )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">2.17</span> Exercise 2.27</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x</span> (list (list 1 2) (list 3 4)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse</span> li)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse-iter</span> src dst)
    (<span style="color: #d1f1a9;">if</span> (null? src)
        dst
        (reverse-iter (cdr src) (cons (car src) dst))))
  (reverse-iter li (list)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">deep-reverse</span> li)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse-iter</span> src dst)
    (<span style="color: #d1f1a9;">if</span> (null? src)
        dst
        (<span style="color: #d1f1a9;">let</span> ((head
               (<span style="color: #d1f1a9;">if</span> (pair? (car src))
                   (reverse-iter (car src) (list))
                   (car src))))
          (reverse-iter (cdr src) (cons head dst)))))
  (reverse-iter li (list)))

(list (reverse x)
      (deep-reverse x))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">2.18</span> Exercise 2.28</h3>
<div class="outline-text-3" id="text-2-18">
<div class="org-src-container">

<pre class="src src-scheme"> (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">leaf?</span> x)
   (<span style="color: #d1f1a9;">and</span> (pair? x)
        (not (pair? (car x)))))

 (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">wrap?</span> x)
   (<span style="color: #d1f1a9;">and</span> (pair? x)
        (null? (cdr x))
        (pair? (car x))))

 (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">append-cps</span> x y f)
   (<span style="color: #d1f1a9;">cond</span> ((null? x) (f y))
         ((not (pair? x)) (f (cons x y)))
         (<span style="color: #d1f1a9;">else</span> (append-cps (cdr x) y (<span style="color: #d1f1a9;">lambda</span> (r) (f (cons (car x) r)))))))

 (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fringe</span> tree)
   (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
   (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fringe-iter</span> src f)
     (<span style="color: #d1f1a9;">cond</span> ((null? src) '())
           ((wrap? src) (fringe-iter (car src) f))
           ((leaf? src) (<span style="color: #d1f1a9;">if</span> (null? (cdr src))
                            (f (car src))
                            (fringe-iter (cdr src) (<span style="color: #d1f1a9;">lambda</span> (x) (f (cons (car src) x))))))
           (<span style="color: #d1f1a9;">else</span> (fringe-iter (car src) (<span style="color: #d1f1a9;">lambda</span> (x) (fringe-iter (cdr src)
                                                                 (<span style="color: #d1f1a9;">lambda</span> (y) (append-cps x y f))))))))
   (fringe-iter tree (<span style="color: #d1f1a9;">lambda</span> (x) (append-cps x '() id))))

 (<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">x</span> (list (list 1 2) (list 3 4)))

(fringe (list x x))
</pre>
</div>
</div>
</div>
