_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.29
#+BEGIN_SRC scheme
  (define (make-mobile left right)
    (list left right))

  (define (make-branch length structure)
    (list length structure))

  (define (left-branch mobile)
    (car mobile))

  (define (right-branch mobile)
    (car (cdr mobile)))

  (define (branch-length branch)
    (car branch))

  (define (branch-structure branch)
    (car (cdr branch)))

  (define (mobile? x)
    (and (pair? x)
         (branch? (left-branch x))
         (branch? (right-branch x))))

  (define (branch? x)
    (and (pair? x)
         (not (pair? (car x)))))

  (define (total-weight mobile)
    (define (id x) x)
    (define (total-weight-cps x f)
      (if (mobile? x)
          (let ((ll (branch-length (left-branch x)))
                (rl (branch-length (right-branch x)))
                (ls (branch-structure (left-branch x)))
                (rs (branch-structure (right-branch x))))
            (total-weight-cps ls
                              (lambda (lw) (total-weight-cps rs
                                                             (lambda (rw) (f (+ lw rw)))))))
          (f x)))
    (total-weight-cps mobile id))

  (define (torque x)
    (if (branch? x)
        (let ((bl (branch-length x))
              (bs (branch-structure x)))
          (* bl (total-weight bs)))))

  (define (is-balence? mobile)
    (define (id x) x)
    (define (is-balence?-cps x f)
      (if (mobile? x)
          (let ((l (left-branch x))
                (r (right-branch x))
                (ll (branch-length (left-branch x)))
                (rl (branch-length (right-branch x)))
                (ls (branch-structure (left-branch x)))
                (rs (branch-structure (right-branch x))))
            (if (eq? (torque l) (torque r))
                (is-balence?-cps ls
                                 (lambda (lb) (is-balence?-cps rs
                                                               (lambda (rb) (f (and lb rb))))))
                (f #f)))
          (f #t)))
    (is-balence?-cps mobile id))
  #|Test|#

  (define m1 (make-mobile (make-branch 10 100)
                          (make-branch 5 200)))

  (define m2 (make-mobile (make-branch 3 100)
                          (make-branch 4 50)))

  (define m (make-mobile (make-branch 4 m1)
                         (make-branch 8 m2)))

  (list
   (total-weight m1)
   (total-weight m2)
   (total-weight m)
   (is-balence? m1)
   (is-balence? m2)
   (is-balence? m))
#+END_SRC
#+RESULTS:
| 300 | 150 | 450 | t | f | f |

** Exercise 2.30, 2.31
#+BEGIN_SRC scheme
  (define (recursive-map-tree tree op)
    (cond ((null? tree) '())
          ((not (pair? tree)) (op tree))
          (else (cons (recursive-map-tree (car tree) op)
                      (recursive-map-tree (cdr tree) op)))))

  (define (iterative-map-tree tree op)
    (define (id x) x)
    (define (map-tree-cps x f)
      (cond ((null? x) (f '()))
            ((not (pair? x)) (f (op x)))
            (else (map-tree-cps (car x)
                                (lambda (lt) (map-tree-cps (cdr x)
                                                           (lambda (rt) (f (cons lt rt)))))))))
    (map-tree-cps tree id))
  #|Test|#
  (define t (list 1 (list 2 (list 3 4) 5) (list 6 7)))

  (define (op x)
    (* x x))

  (list t
        (recursive-map-tree t op)
        (iterative-map-tree t op))
#+END_SRC

#+RESULTS:
| 1 | (2 (3 4) 5)   | (6 7)   |
| 1 | (4 (9 16) 25) | (36 49) |
| 1 | (4 (9 16) 25) | (36 49) |

** Exercise 2.32
#+BEGIN_SRC scheme
  (define (iterative-map-list li op)
    (define (id x) x)
    (define (map-list-cps x f)
      (if (null? x)
          (f '())
          (map-list-cps (cdr x)
                        (lambda (l)
                          (cons (op (car x)) l)))))
    (map-list-cps li id))

  (define (subsets s)
    (if (null? s)
        (list s)
        (let ((rest (subsets (cdr s))))
          (append rest (iterative-map-list rest (lambda (x) (cons (car s) x)))))))
  #|Test|#
  (define s (list 1 2 3 (list 4 5) 6 7))

  (subsets s)
#+END_SRC

#+RESULTS:
|     7 |       |       |       |   |   |
|     6 |     7 |       |       |   |   |
| (4 5) |     6 |     7 |       |   |   |
|     3 | (4 5) |     6 |     7 |   |   |
|     2 |     3 | (4 5) |     6 | 7 |   |
|     1 |     2 |     3 | (4 5) | 6 | 7 |

** Exercise 2.33, 2.34
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (map p sequence)
    (accumulate (lambda (x y) (cons (p x) y)) '() sequence))

  (define (append seq1 seq2)
    (accumulate cons seq2 seq1))

  (define (length sequence)
    (accumulate (lambda (x y) (+ y 1)) 0 sequence))

  (define (horner-eval x coefficient-sequence)
    (accumulate (lambda (this-coeff higher-terms)
                  (+ this-coeff (* x higher-terms)))
                0
                coefficient-sequence))
  #|Test|#

  (define l1 (list 1 2 3 4 5))

  (define l2 (list 6 7 8))

  (define (f x) (+ x 1))

  (list (map f l1)
        (append l1 l2)
        (length l1)
        (horner-eval 0 (list 2 2 2))
        (horner-eval 2 (list 2 2 2)))
#+END_SRC

#+RESULTS:
| (2 3 4 5 6) | (1 2 3 4 5 6 7 8) | 5 | 2 | 14 |

