_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">2.19</span> Exercise 2.29</h3>
<div class="outline-text-3" id="text-2-19">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-mobile</span> left right)
  (list left right))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-branch</span> length structure)
  (list length structure))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">left-branch</span> mobile)
  (car mobile))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">right-branch</span> mobile)
  (car (cdr mobile)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">branch-length</span> branch)
  (car branch))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">branch-structure</span> branch)
  (car (cdr branch)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">mobile?</span> x)
  (<span style="color: #d1f1a9;">and</span> (pair? x)
       (branch? (left-branch x))
       (branch? (right-branch x))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">branch?</span> x)
  (<span style="color: #d1f1a9;">and</span> (pair? x)
       (not (pair? (car x)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">total-weight</span> mobile)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">total-weight-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (mobile? x)
        (<span style="color: #d1f1a9;">let</span> ((ll (branch-length (left-branch x)))
              (rl (branch-length (right-branch x)))
              (ls (branch-structure (left-branch x)))
              (rs (branch-structure (right-branch x))))
          (total-weight-cps ls
                            (<span style="color: #d1f1a9;">lambda</span> (lw) (total-weight-cps rs
                                                           (<span style="color: #d1f1a9;">lambda</span> (rw) (f (+ lw rw)))))))
        (f x)))
  (total-weight-cps mobile id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">torque</span> x)
  (<span style="color: #d1f1a9;">if</span> (branch? x)
      (<span style="color: #d1f1a9;">let</span> ((bl (branch-length x))
            (bs (branch-structure x)))
        (* bl (total-weight bs)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">is-balence?</span> mobile)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">is-balence?-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (mobile? x)
        (<span style="color: #d1f1a9;">let</span> ((l (left-branch x))
              (r (right-branch x))
              (ll (branch-length (left-branch x)))
              (rl (branch-length (right-branch x)))
              (ls (branch-structure (left-branch x)))
              (rs (branch-structure (right-branch x))))
          (<span style="color: #d1f1a9;">if</span> (eq? (torque l) (torque r))
              (is-balence?-cps ls
                               (<span style="color: #d1f1a9;">lambda</span> (lb) (is-balence?-cps rs
                                                             (<span style="color: #d1f1a9;">lambda</span> (rb) (f (<span style="color: #d1f1a9;">and</span> lb rb))))))
              (f #f)))
        (f #t)))
  (is-balence?-cps mobile id))
<span style="color: #7285b7; font-style: italic;">#|Test|#</span>

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">m1</span> (make-mobile (make-branch 10 100)
                        (make-branch 5 200)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">m2</span> (make-mobile (make-branch 3 100)
                        (make-branch 4 50)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">m</span> (make-mobile (make-branch 4 m1)
                       (make-branch 8 m2)))

(list
 (total-weight m1)
 (total-weight m2)
 (total-weight m)
 (is-balence? m1)
 (is-balence? m2)
 (is-balence? m))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">2.20</span> Exercise 2.30, 2.31</h3>
<div class="outline-text-3" id="text-2-20">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">recursive-map-tree</span> tree op)
  (<span style="color: #d1f1a9;">cond</span> ((null? tree) '())
        ((not (pair? tree)) (op tree))
        (<span style="color: #d1f1a9;">else</span> (cons (recursive-map-tree (car tree) op)
                    (recursive-map-tree (cdr tree) op)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iterative-map-tree</span> tree op)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">map-tree-cps</span> x f)
    (<span style="color: #d1f1a9;">cond</span> ((null? x) (f '()))
          ((not (pair? x)) (f (op x)))
          (<span style="color: #d1f1a9;">else</span> (map-tree-cps (car x)
                              (<span style="color: #d1f1a9;">lambda</span> (lt) (map-tree-cps (cdr x)
                                                         (<span style="color: #d1f1a9;">lambda</span> (rt) (f (cons lt rt)))))))))
  (map-tree-cps tree id))
<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">t</span> (list 1 (list 2 (list 3 4) 5) (list 6 7)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">op</span> x)
  (* x x))

(list t
      (recursive-map-tree t op)
      (iterative-map-tree t op))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">2.21</span> Exercise 2.32</h3>
<div class="outline-text-3" id="text-2-21">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">iterative-map-list</span> li op)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">map-list-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (null? x)
        (f '())
        (map-list-cps (cdr x)
                      (<span style="color: #d1f1a9;">lambda</span> (l)
                        (cons (op (car x)) l)))))
  (map-list-cps li id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">subsets</span> s)
  (<span style="color: #d1f1a9;">if</span> (null? s)
      (list s)
      (<span style="color: #d1f1a9;">let</span> ((rest (subsets (cdr s))))
        (append rest (iterative-map-list rest (<span style="color: #d1f1a9;">lambda</span> (x) (cons (car s) x)))))))
<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">s</span> (list 1 2 3 (list 4 5) 6 7))

(subsets s)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">2.22</span> Exercise 2.33, 2.34</h3>
<div class="outline-text-3" id="text-2-22">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">map</span> p sequence)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (x y) (cons (p x) y)) '() sequence))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">append</span> seq1 seq2)
  (accumulate cons seq2 seq1))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">length</span> sequence)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (x y) (+ y 1)) 0 sequence))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">horner-eval</span> x coefficient-sequence)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (this-coeff higher-terms)
                (+ this-coeff (* x higher-terms)))
              0
              coefficient-sequence))
<span style="color: #7285b7; font-style: italic;">#|Test|#</span>

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">l1</span> (list 1 2 3 4 5))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">l2</span> (list 6 7 8))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">f</span> x) (+ x 1))

(list (<span style="color: #d1f1a9;">map</span> f l1)
      (append l1 l2)
      (length l1)
      (horner-eval 0 (list 2 2 2))
      (horner-eval 2 (list 2 2 2)))
</pre>
</div>
</div>
</div>
