_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.35
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (count-leaves t)
    (accumulate (lambda (z x) (+ z x))
                0
                (map (lambda (x)
                         (cond ((null? x) '())
                               ((pair? x) (count-leaves x))
                               (else 1))) t)))

  #|Test|#
  (define t (list (list 1 2) 3 4 (list 5 6) 7))

  (count-leaves t)
#+END_SRC

#+RESULTS:
: 7

** Exercise 2.36
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (seqs-split seqs)
    (define (li-id x y) (cons x y))
    (define (seqs-split-cps seqs f)
      (if (null? seqs)
          (f '() '())
          (seqs-split-cps (cdr seqs)
                          (lambda (x y)
                            (f (cons (car (car seqs)) x)
                               (cons (cdr (car seqs)) y))))))
    (seqs-split-cps seqs li-id))

  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        '()
        (let ((split-seqs (seqs-split seqs)))
          (cons (accumulate op init (car split-seqs))
                (accumulate-n op init (cdr split-seqs))))))

  #|Test|#
  (define li (list (list 1 2 3 4)
                   (list 3 4 5 6)
                   (list 5 6 7 8)))

  (accumulate-n (lambda (z x)
                  (+ z x))
                0
                li)
#+END_SRC

#+RESULTS:
| 9 | 12 | 15 | 18 |

** Exercise 2.37
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (seqs-split seqs)
    (define (li-id x y) (cons x y))
    (define (seqs-split-cps seqs f)
      (if (null? seqs)
          (f '() '())
          (seqs-split-cps (cdr seqs)
                          (lambda (x y)
                            (f (cons (car (car seqs)) x)
                               (cons (cdr (car seqs)) y))))))
    (seqs-split-cps seqs li-id))

  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        '()
        (let ((split-seqs (seqs-split seqs)))
          (cons (accumulate op init (car split-seqs))
                (accumulate-n op init (cdr split-seqs))))))

  (define (dot-product v w)
    (accumulate + 0 (map * v w)))

  (define (matrix-*-vector m v)
    (map (lambda (w)
           (dot-product w v)) m))

  (define (transpose mat)
    (accumulate-n cons '() mat))

  (define (matrix-*-matrix m n)
    (let ((cols (transpose n)))
      (map (lambda (x)
             (matrix-*-vector cols x))
           m)))
  #|Test|#
  (define v (list 1 2 3 4))

  (define w (list 2 4 6 8))

  (define n (list (list 2 2) (list 3 3) (list 4 4) (list 5 5)))

  (define m (list (list 1 1 1 1) w))

  (list (dot-product v w)
        (matrix-*-vector m v)
        (transpose m)
        (matrix-*-matrix m n))
#+END_SRC

#+RESULTS:
| 60 | (10 60) | ((1 2) (1 4) (1 6) (1 8)) | ((14 14) (80 80)) |

** Exercise 2.38
#+BEGIN_SRC scheme
  (define (fold-right op initial sequence)
    (define (id x) x)
    (define (fold-right-cps seq f)
      (if (null? seq)
          (f initial)
          (fold-right-cps (cdr seq)
                          (lambda (x)
                            (f (op x (car seq)))))))
    (fold-right-cps sequence id))

  (define (fold-left op initial sequence)
    (define (id x) x)
    (define (fold-left-cps seq r f)
      (if (null? seq)
          (f r)
          (fold-left-cps (cdr seq)
                         (op r (car seq))
                         f)))
    (fold-left-cps sequence initial id))

  #|Test|#
  (define seq (list 1 2 3 4))

  (list (fold-right (lambda (z x)
                      (+ x (* 2 z))) 0 seq)
        (fold-left (lambda (z x)
                     (+ x (* 2 z))) 0 seq))
#+END_SRC

#+RESULTS:
| 49 | 26 |

** Exercise 2.39
#+BEGIN_SRC scheme
  (define (fold-right op initial sequence)
    (define (id x) x)
    (define (fold-right-cps seq f)
      (if (null? seq)
          (f initial)
          (fold-right-cps (cdr seq)
                          (lambda (x)
                            (f (op x (car seq)))))))
    (fold-right-cps sequence id))

  (define (fold-left op initial sequence)
    (define (id x) x)
    (define (fold-left-cps seq r f)
      (if (null? seq)
          (f r)
          (fold-left-cps (cdr seq)
                         (op r (car seq))
                         f)))
    (fold-left-cps sequence initial id))

  (define (reverse-right sequence)
    (fold-right (lambda (z x)
                  (append z (list x)))
                '()
                sequence))

  (define (reverse-left sequence)
    (fold-left (lambda (z x)
                 (cons x z))
               '()
               sequence))

  #|Test|#
  (define li (list 1 2 3 4))

  (list (reverse-right li)
        (reverse-left li))
#+END_SRC

#+RESULTS:
| 4 | 3 | 2 | 1 |
| 4 | 3 | 2 | 1 |

