_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">2.23</span> Exercise 2.35</h3>
<div class="outline-text-3" id="text-2-23">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">count-leaves</span> t)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (z x) (+ z x))
              0
              (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (x)
                       (<span style="color: #d1f1a9;">cond</span> ((null? x) '())
                             ((pair? x) (count-leaves x))
                             (<span style="color: #d1f1a9;">else</span> 1))) t)))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">t</span> (list (list 1 2) 3 4 (list 5 6) 7))

(count-leaves t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">2.24</span> Exercise 2.36</h3>
<div class="outline-text-3" id="text-2-24">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">seqs-split</span> seqs)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">li-id</span> x y) (cons x y))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">seqs-split-cps</span> seqs f)
    (<span style="color: #d1f1a9;">if</span> (null? seqs)
        (f '() '())
        (seqs-split-cps (cdr seqs)
                        (<span style="color: #d1f1a9;">lambda</span> (x y)
                          (f (cons (car (car seqs)) x)
                             (cons (cdr (car seqs)) y))))))
  (seqs-split-cps seqs li-id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate-n</span> op init seqs)
  (<span style="color: #d1f1a9;">if</span> (null? (car seqs))
      '()
      (<span style="color: #d1f1a9;">let</span> ((split-seqs (seqs-split seqs)))
        (cons (accumulate op init (car split-seqs))
              (accumulate-n op init (cdr split-seqs))))))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">li</span> (list (list 1 2 3 4)
                 (list 3 4 5 6)
                 (list 5 6 7 8)))

(accumulate-n (<span style="color: #d1f1a9;">lambda</span> (z x)
                (+ z x))
              0
              li)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">2.25</span> Exercise 2.37</h3>
<div class="outline-text-3" id="text-2-25">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">seqs-split</span> seqs)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">li-id</span> x y) (cons x y))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">seqs-split-cps</span> seqs f)
    (<span style="color: #d1f1a9;">if</span> (null? seqs)
        (f '() '())
        (seqs-split-cps (cdr seqs)
                        (<span style="color: #d1f1a9;">lambda</span> (x y)
                          (f (cons (car (car seqs)) x)
                             (cons (cdr (car seqs)) y))))))
  (seqs-split-cps seqs li-id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate-n</span> op init seqs)
  (<span style="color: #d1f1a9;">if</span> (null? (car seqs))
      '()
      (<span style="color: #d1f1a9;">let</span> ((split-seqs (seqs-split seqs)))
        (cons (accumulate op init (car split-seqs))
              (accumulate-n op init (cdr split-seqs))))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">dot-product</span> v w)
  (accumulate + 0 (<span style="color: #d1f1a9;">map</span> * v w)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">matrix-*-vector</span> m v)
  (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (w)
         (dot-product w v)) m))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">transpose</span> mat)
  (accumulate-n cons '() mat))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">matrix-*-matrix</span> m n)
  (<span style="color: #d1f1a9;">let</span> ((cols (transpose n)))
    (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (x)
           (matrix-*-vector cols x))
         m)))
<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">v</span> (list 1 2 3 4))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">w</span> (list 2 4 6 8))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">n</span> (list (list 2 2) (list 3 3) (list 4 4) (list 5 5)))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">m</span> (list (list 1 1 1 1) w))

(list (dot-product v w)
      (matrix-*-vector m v)
      (transpose m)
      (matrix-*-matrix m n))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">2.26</span> Exercise 2.38</h3>
<div class="outline-text-3" id="text-2-26">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-right</span> op initial sequence)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-right-cps</span> seq f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f initial)
        (fold-right-cps (cdr seq)
                        (<span style="color: #d1f1a9;">lambda</span> (x)
                          (f (op x (car seq)))))))
  (fold-right-cps sequence id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-left</span> op initial sequence)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-left-cps</span> seq r f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f r)
        (fold-left-cps (cdr seq)
                       (op r (car seq))
                       f)))
  (fold-left-cps sequence initial id))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">seq</span> (list 1 2 3 4))

(list (fold-right (<span style="color: #d1f1a9;">lambda</span> (z x)
                    (+ x (* 2 z))) 0 seq)
      (fold-left (<span style="color: #d1f1a9;">lambda</span> (z x)
                   (+ x (* 2 z))) 0 seq))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">2.27</span> Exercise 2.39</h3>
<div class="outline-text-3" id="text-2-27">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-right</span> op initial sequence)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-right-cps</span> seq f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f initial)
        (fold-right-cps (cdr seq)
                        (<span style="color: #d1f1a9;">lambda</span> (x)
                          (f (op x (car seq)))))))
  (fold-right-cps sequence id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-left</span> op initial sequence)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">fold-left-cps</span> seq r f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f r)
        (fold-left-cps (cdr seq)
                       (op r (car seq))
                       f)))
  (fold-left-cps sequence initial id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse-right</span> sequence)
  (fold-right (<span style="color: #d1f1a9;">lambda</span> (z x)
                (append z (list x)))
              '()
              sequence))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">reverse-left</span> sequence)
  (fold-left (<span style="color: #d1f1a9;">lambda</span> (z x)
               (cons x z))
             '()
             sequence))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">li</span> (list 1 2 3 4))

(list (reverse-right li)
      (reverse-left li))
</pre>
</div>
</div>
</div>
