_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.40
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (flatmap proc seq)
    (accumulate append '() (map proc seq)))

  (define (enumerate-interval x y)
    (define (id x) x)
    (define (enumerate-interval-cps x f)
      (if (> x y)
          (f '())
          (enumerate-interval-cps (+ x 1)
                                  (lambda (s)
                                    (f (cons x s))))))
    (enumerate-interval-cps x id))

  (define (unique-pairs n)
    (flatmap (lambda (x)
               (map (lambda (y)
                      (list y x))
                    (enumerate-interval 1 (- x 1))))
             (enumerate-interval 1 n)))

  #|Test|#
  (unique-pairs 5)
#+END_SRC

#+RESULTS:
| 1 | 2 |
| 1 | 3 |
| 2 | 3 |
| 1 | 4 |
| 2 | 4 |
| 3 | 4 |
| 1 | 5 |
| 2 | 5 |
| 3 | 5 |
| 4 | 5 |

** Exercise 2.41
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (flatmap proc seq)
    (accumulate append '() (map proc seq)))

  (define (enumerate-interval x y)
    (define (id x) x)
    (define (enumerate-interval-cps x f)
      (if (> x y)
          (f '())
          (enumerate-interval-cps (+ x 1)
                                  (lambda (s)
                                    (f (cons x s))))))
    (enumerate-interval-cps x id))

  (define (filter predicate seq)
    (define (id x) x)
    (define (filter-cps seq f)
      (if (null? seq)
          (f '())
          (if (predicate (car seq))
              (filter-cps (cdr seq) (lambda (x)
                                      (f (cons (car seq) x))))
              (filter-cps (cdr seq) f))))
    (filter-cps seq id))

  (define (tri-sum s n)
    (flatmap (lambda (a)
               (map (lambda (b)
                      (list a b (- s a b)))
                    (filter (lambda (x)
                              (and (not (= x a))
                                   (not (= (* 2 x) (- s a)))))
                     (enumerate-interval (max 1 (- n a)) (min n (- s a))))))
             (enumerate-interval 1 (min n s))))

  #|Test|#
  (tri-sum 8 5)
#+END_SRC

#+RESULTS:
| 1 | 4 | 3 |
| 1 | 5 | 2 |
| 2 | 4 | 2 |
| 2 | 5 | 1 |
| 3 | 2 | 3 |
| 3 | 4 | 1 |
| 3 | 5 | 0 |
| 4 | 1 | 3 |
| 4 | 3 | 1 |
| 5 | 1 | 2 |
| 5 | 2 | 1 |
| 5 | 3 | 0 |

** Exercise 2.42
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))

  (define (flatmap proc seq)
    (accumulate append '() (map proc seq)))

  (define (enumerate-interval x y)
    (define (id x) x)
    (define (enumerate-interval-cps x f)
      (if (> x y)
          (f '())
          (enumerate-interval-cps (+ x 1)
                                  (lambda (s)
                                    (f (cons x s))))))
    (enumerate-interval-cps x id))

  (define (filter predicate seq)
    (define (id x) x)
    (define (filter-cps seq f)
      (if (null? seq)
          (f '())
          (if (predicate (car seq))
              (filter-cps (cdr seq) (lambda (x)
                                      (f (cons (car seq) x))))
              (filter-cps (cdr seq) f))))
    (filter-cps seq id))

  (define (adjoin-position new k rest)
    (append rest (list new)))

  (define (list-get li n)
    (if (= n 0)
        (car li)
        (list-get (cdr li) (- n 1))))

  (define (safe? k positions)
    (accumulate (lambda (x y)
                  (and x y))
                #t
                (map (lambda (i)
                       (let ((x (list-get positions (- k 1)))
                             (y (list-get positions (- i 1))))
                         (and (not (= x y))
                              (not (= x (+ y (- k i))))
                              (not (= x (- y (- k i)))))))
                     (enumerate-interval 1 (- k 1)))))

  (define (queens board-size)
    (define (queen-cols k)
      (if (= k 1) (map list (enumerate-interval 1 board-size))
          (filter (lambda (positions) (safe? k positions))
                  (flatmap (lambda (rest-of-queens)
                             (map (lambda (new-row)
                                    (adjoin-position new-row k rest-of-queens))
                                  (enumerate-interval 1 board-size)))
                           (queen-cols (- k 1))))))
    (queen-cols board-size))

  (queens 4)
#+END_SRC

#+RESULTS:
| 2 | 4 | 1 | 3 |
| 3 | 1 | 4 | 2 |

** Exercise 2.42
T^{2}

** Exercise 2.53
#+BEGIN_SRC scheme
  (list
   (list 'a 'b 'c) ; (a b c)
   (list (list 'george)) ; ((george))
   (cdr '((x1 x2) (y1 y2))) ; ((y1 y2))
   (car '((x1 x2) (y1 y2))) ; (x1 x2)
   (pair? (car '(a short list))) ; #f
   (memq 'red '((red shoes) (blue socks))) ; #f
   (memq 'red '(shoes red blue socks)) ; # (red blue socks)
   )
#+END_SRC

#+RESULTS:
| (a b c) | ((george)) | ((y1 y2)) | (x1 x2) | f | f | (red blue socks) |

