_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="section-number-3">2.28</span> Exercise 2.40</h3>
<div class="outline-text-3" id="text-2-28">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">flatmap</span> proc seq)
  (accumulate append '() (<span style="color: #d1f1a9;">map</span> proc seq)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval</span> x y)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (&gt; x y)
        (f '())
        (enumerate-interval-cps (+ x 1)
                                (<span style="color: #d1f1a9;">lambda</span> (s)
                                  (f (cons x s))))))
  (enumerate-interval-cps x id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">unique-pairs</span> n)
  (flatmap (<span style="color: #d1f1a9;">lambda</span> (x)
             (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (y)
                    (list y x))
                  (enumerate-interval 1 (- x 1))))
           (enumerate-interval 1 n)))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(unique-pairs 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline70" class="outline-3">
<h3 id="orgheadline70"><span class="section-number-3">2.29</span> Exercise 2.41</h3>
<div class="outline-text-3" id="text-2-29">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">flatmap</span> proc seq)
  (accumulate append '() (<span style="color: #d1f1a9;">map</span> proc seq)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval</span> x y)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (&gt; x y)
        (f '())
        (enumerate-interval-cps (+ x 1)
                                (<span style="color: #d1f1a9;">lambda</span> (s)
                                  (f (cons x s))))))
  (enumerate-interval-cps x id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">filter</span> predicate seq)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">filter-cps</span> seq f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f '())
        (<span style="color: #d1f1a9;">if</span> (predicate (car seq))
            (filter-cps (cdr seq) (<span style="color: #d1f1a9;">lambda</span> (x)
                                    (f (cons (car seq) x))))
            (filter-cps (cdr seq) f))))
  (filter-cps seq id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">tri-sum</span> s n)
  (flatmap (<span style="color: #d1f1a9;">lambda</span> (a)
             (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (b)
                    (list a b (- s a b)))
                  (filter (<span style="color: #d1f1a9;">lambda</span> (x)
                            (<span style="color: #d1f1a9;">and</span> (not (= x a))
                                 (not (= (* 2 x) (- s a)))))
                   (enumerate-interval (max 1 (- n a)) (min n (- s a))))))
           (enumerate-interval 1 (min n s))))

<span style="color: #7285b7; font-style: italic;">#|Test|#</span>
(tri-sum 8 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline71" class="outline-3">
<h3 id="orgheadline71"><span class="section-number-3">2.30</span> Exercise 2.42</h3>
<div class="outline-text-3" id="text-2-30">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulate</span> op initial sequence)
  (<span style="color: #d1f1a9;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">flatmap</span> proc seq)
  (accumulate append '() (<span style="color: #d1f1a9;">map</span> proc seq)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval</span> x y)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">enumerate-interval-cps</span> x f)
    (<span style="color: #d1f1a9;">if</span> (&gt; x y)
        (f '())
        (enumerate-interval-cps (+ x 1)
                                (<span style="color: #d1f1a9;">lambda</span> (s)
                                  (f (cons x s))))))
  (enumerate-interval-cps x id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">filter</span> predicate seq)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">id</span> x) x)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">filter-cps</span> seq f)
    (<span style="color: #d1f1a9;">if</span> (null? seq)
        (f '())
        (<span style="color: #d1f1a9;">if</span> (predicate (car seq))
            (filter-cps (cdr seq) (<span style="color: #d1f1a9;">lambda</span> (x)
                                    (f (cons (car seq) x))))
            (filter-cps (cdr seq) f))))
  (filter-cps seq id))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">adjoin-position</span> new k rest)
  (append rest (list new)))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">list-get</span> li n)
  (<span style="color: #d1f1a9;">if</span> (= n 0)
      (car li)
      (list-get (cdr li) (- n 1))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">safe?</span> k positions)
  (accumulate (<span style="color: #d1f1a9;">lambda</span> (x y)
                (<span style="color: #d1f1a9;">and</span> x y))
              #t
              (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (i)
                     (<span style="color: #d1f1a9;">let</span> ((x (list-get positions (- k 1)))
                           (y (list-get positions (- i 1))))
                       (<span style="color: #d1f1a9;">and</span> (not (= x y))
                            (not (= x (+ y (- k i))))
                            (not (= x (- y (- k i)))))))
                   (enumerate-interval 1 (- k 1)))))

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">queens</span> board-size)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">queen-cols</span> k)
    (<span style="color: #d1f1a9;">if</span> (= k 1) (<span style="color: #d1f1a9;">map</span> list (enumerate-interval 1 board-size))
        (filter (<span style="color: #d1f1a9;">lambda</span> (positions) (safe? k positions))
                (flatmap (<span style="color: #d1f1a9;">lambda</span> (rest-of-queens)
                           (<span style="color: #d1f1a9;">map</span> (<span style="color: #d1f1a9;">lambda</span> (new-row)
                                  (adjoin-position new-row k rest-of-queens))
                                (enumerate-interval 1 board-size)))
                         (queen-cols (- k 1))))))
  (queen-cols board-size))

(queens 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">2.31</span> Exercise 2.42</h3>
<div class="outline-text-3" id="text-2-31">
<p>
T<sup>2</sup><br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-3">
<h3 id="orgheadline73"><span class="section-number-3">2.32</span> Exercise 2.53</h3>
<div class="outline-text-3" id="text-2-32">
<div class="org-src-container">

<pre class="src src-scheme">(list
 (list 'a 'b 'c) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">(a b c)</span>
 (list (list 'george)) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">((george))</span>
 (cdr '((x1 x2) (y1 y2))) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">((y1 y2))</span>
 (car '((x1 x2) (y1 y2))) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">(x1 x2)</span>
 (pair? (car '(a short list))) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">#f</span>
 (memq 'red '((red shoes) (blue socks))) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">#f</span>
 (memq 'red '(shoes red blue socks)) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;"># (red blue socks)</span>
 )
</pre>
</div>
</div>
</div>
