_org/2015-11-10-SICP_Exercise_Results.org
** Exercise 2.54
#+BEGIN_SRC scheme
  (define (equal? s1 s2)
    (if (and (pair? s1) (pair? s2)) ; if they are all pairs
        (and (eq? (car s1) (car s2)) (equal? (cdr s1) (cdr s2)))
        (eq? s1 s2)))

  ;; Test
  (define li1 '(this is a list))

  (define li2 '(this (is a) list))

  (list (equal? li1 li1)
        (equal? li1 li2))
#+END_SRC

#+RESULTS:
| t | f |

** Exercise 2.55
#+BEGIN_SRC scheme
  (car ''abracadabra)
  (car (quote (quote abracadabra)))
  (car (list 'quote 'abracadabra))
  'quote
#+END_SRC

** Exercise 3.1
#+BEGIN_SRC scheme
  (define (make-accumulator init)
    (define (accumulator increment)
      (set! init (+ init increment))
      init)
    accumulator)

  ;; Test
  (define A (make-accumulator 5))
  (list (A 10)
        (A 10))
#+END_SRC

#+RESULTS:
| 15 | 25 |

** Exercise 3.2
#+BEGIN_SRC scheme
  (define (make-monitored f)
    (define call-count 0)
    (lambda (x)
      (cond ((eq? x 'how-many-calls?)
             call-count)
            ((eq? x 'reset-count)
             (begin (set! call-count 0)
                    call-count))
            (else (begin
                    (set! call-count (+ call-count 1))
                    (f x))))))

  ;; Test
  (define s (make-monitored sqrt))

  (list (s 100)
        (s 81)
        (s 'how-many-calls?)
        (s 'reset-count)
        (s 25)
        (s 'how-many-calls?))
#+END_SRC

#+RESULTS:
| 10 | 9 | 2 | 0 | 5 | 1 |

** Exercise 3.3, 3.4
#+BEGIN_SRC scheme
  (define (call-the-cops amount)
    "Already called cops")

  (define (make-account balance pwd)
    (define psw-wrong-times 0)
    (define (withdraw amount)
      (if (>= balance amount)
          (begin (set! balance (- balance amount))
                 balance)
          "Insufficient funds"))
    (define (deposit amount)
      (set! balance (+ balance amount))
      balance)
    (define (complain amount)
      "!")
    (define (dispatch p m)
      (if (not (eq? pwd p))
          (begin
            (set! psw-wrong-times (+ psw-wrong-times 1))
            (if (>= psw-wrong-times 7)
                call-the-cops
                complain))
          (begin
            (set! psw-wrong-times 0)
            (cond ((eq? m 'withdraw) withdraw)
                  ((eq? m 'deposit) deposit)
                  (else (error "Unknown request -- MAKE-ACOUNT" m))))))
    dispatch)

  ;; Test

  (define acc (make-account 100 'secret-password))

  (list
   ((acc 'secret-password 'withdraw) 50)
   ((acc 'secret-password 'withdraw) 60)
   ((acc 'secret-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'secret-password 'withdraw) 60)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40)
   ((acc 'wrong-password 'deposit) 40))
#+END_SRC

#+RESULTS:
| 50 | Insufficient funds | 90 | ! | ! | ! | ! | ! | ! | 30 | ! | ! | ! | ! | ! | ! | Already called cops |
