_posts/2015-11-10-SICP_Exercise_Results.org.html

<div id="outline-container-orgheadline74" class="outline-3">
<h3 id="orgheadline74"><span class="section-number-3">2.33</span> Exercise 2.54</h3>
<div class="outline-text-3" id="text-2-33">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">equal?</span> s1 s2)
  (<span style="color: #d1f1a9;">if</span> (<span style="color: #d1f1a9;">and</span> (pair? s1) (pair? s2)) <span style="color: #7285b7; font-style: italic;">; </span><span style="color: #7285b7; font-style: italic;">if they are all pairs</span>
      (<span style="color: #d1f1a9;">and</span> (eq? (car s1) (car s2)) (equal? (cdr s1) (cdr s2)))
      (eq? s1 s2)))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Test</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">li1</span> '(this is a list))

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">li2</span> '(this (is a) list))

(list (equal? li1 li1)
      (equal? li1 li2))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline75" class="outline-3">
<h3 id="orgheadline75"><span class="section-number-3">2.34</span> Exercise 2.55</h3>
<div class="outline-text-3" id="text-2-34">
<div class="org-src-container">

<pre class="src src-scheme">(car ''abracadabra)
(car (quote (quote abracadabra)))
(car (list 'quote 'abracadabra))
'quote
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline76" class="outline-3">
<h3 id="orgheadline76"><span class="section-number-3">2.35</span> Exercise 3.1</h3>
<div class="outline-text-3" id="text-2-35">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-accumulator</span> init)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">accumulator</span> increment)
    (set! init (+ init increment))
    init)
  accumulator)

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Test</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">A</span> (make-accumulator 5))
(list (A 10)
      (A 10))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline77" class="outline-3">
<h3 id="orgheadline77"><span class="section-number-3">2.36</span> Exercise 3.2</h3>
<div class="outline-text-3" id="text-2-36">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-monitored</span> f)
  (<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">call-count</span> 0)
  (<span style="color: #d1f1a9;">lambda</span> (x)
    (<span style="color: #d1f1a9;">cond</span> ((eq? x 'how-many-calls?)
           call-count)
          ((eq? x 'reset-count)
           (<span style="color: #d1f1a9;">begin</span> (set! call-count 0)
                  call-count))
          (<span style="color: #d1f1a9;">else</span> (<span style="color: #d1f1a9;">begin</span>
                  (set! call-count (+ call-count 1))
                  (f x))))))

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Test</span>
(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">s</span> (make-monitored sqrt))

(list (s 100)
      (s 81)
      (s 'how-many-calls?)
      (s 'reset-count)
      (s 25)
      (s 'how-many-calls?))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-3">
<h3 id="orgheadline78"><span class="section-number-3">2.37</span> Exercise 3.3, 3.4</h3>
<div class="outline-text-3" id="text-2-37">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">call-the-cops</span> amount)
  <span style="color: #99ffff;">"Already called cops"</span>)

(<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">make-account</span> balance pwd)
  (<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">psw-wrong-times</span> 0)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">withdraw</span> amount)
    (<span style="color: #d1f1a9;">if</span> (&gt;= balance amount)
        (<span style="color: #d1f1a9;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #99ffff;">"Insufficient funds"</span>))
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">complain</span> amount)
    <span style="color: #99ffff;">"!"</span>)
  (<span style="color: #d1f1a9;">define</span> (<span style="color: #ffc58f;">dispatch</span> p m)
    (<span style="color: #d1f1a9;">if</span> (not (eq? pwd p))
        (<span style="color: #d1f1a9;">begin</span>
          (set! psw-wrong-times (+ psw-wrong-times 1))
          (<span style="color: #d1f1a9;">if</span> (&gt;= psw-wrong-times 7)
              call-the-cops
              complain))
        (<span style="color: #d1f1a9;">begin</span>
          (set! psw-wrong-times 0)
          (<span style="color: #d1f1a9;">cond</span> ((eq? m 'withdraw) withdraw)
                ((eq? m 'deposit) deposit)
                (<span style="color: #d1f1a9;">else</span> (error <span style="color: #99ffff;">"Unknown request -- MAKE-ACOUNT"</span> m))))))
  dispatch)

<span style="color: #7285b7; font-style: italic;">;; </span><span style="color: #7285b7; font-style: italic;">Test</span>

(<span style="color: #d1f1a9;">define</span> <span style="color: #ffc58f;">acc</span> (make-account 100 'secret-password))

(list
 ((acc 'secret-password 'withdraw) 50)
 ((acc 'secret-password 'withdraw) 60)
 ((acc 'secret-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'secret-password 'withdraw) 60)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40)
 ((acc 'wrong-password 'deposit) 40))
</pre>
</div>
</div>
</div>
</div>
